[
  {
    "Review": "We only had one night in Colombo and after 2 weeks of local food, we were really in the mood for some Indian food. We read about this place in our guide book plus on TripAdvisor and decided to go here for dinner.Upon arrival we were nicely greeted and shown to a nice table. Assistant Manager Sugeertharan took care of us that evening, giving really good advice on food and drinks. He knew exactly what we wanted to eat, plus how much would be a good portion.The food was awesome and for both of us one of the best Indian experiences we ever had. Compliments to the chef Veera Silambu.The day after we were flying back home, so we went back for lunch. The staff remembered us from the evening before which was nice. The food, again, was amazing.Can definitely recommend Chutneys for a luxurious dinner experience. Thank you again Sugeertharan for the nice service and food recommendations! :) "
  },
  {
    "Review": "'Great value for money' Great taste food for comparatively very reasonable price. You should always call and reserve a table. The staff is one of the most friendliest I've ever come across. If you get lost on what to order always ask the staff and they will suggest a suitable one. Special thanks to Mr. Nilupul for the very friendly service you provided to our family!"
  },
  {
    "Review": "Stayed for first two weeks of July for a convention and from the moment we arrived we received professionalism and care from all the staff. This was impressive as the hotel was fully booked the whole time because of the convention. Tanya on Reception was especially helpful in a ‘saree crisis’."
  },
  {
    "Review": "We had the most fantastic meal and the best possible service here, the food is incredible and Sugeertharan went out of his way to make us feel happy and welcome. You should come here if you are in Colombo and fancy a treat."
  },
  {
    "Review": "We stayed for 10 days it’s the best hotel in Colombo !!! One whole big resort there’s everything close to the mall , amazing location v friendly staffClean & very high standards . It felt home away from home"
  },
  {
    "Review": "We staied at Cinnamom Grand for 10 days for a Special Convention in Colombo with our friends. The atmosphiere was wonderful, the worker taked care of us in every way, and in according with Srilankan culture they are always smiling and happy to do more then their work to feel you are like at your own sweet home. Thilini is a chef and she suggest you new taste every day. We love Srilankan people and Cinnamom are worthy of our praise and our smile of thanks for their wonderful work."
  },
  {
    "Review": "Great food, lovely atmosphere and excellent service by Sam! Highly recommend for authentic South Indian cuisine in Colombo. Make sure to make a reservation in advance as it tends to get quite busy even on weekdays."
  },
  {
    "Review": "Room service Mr.vigneshwar he is very cooperative... nice servicing and friendly...Cinnamon grand hotel is my preferred choice in Colombo ...I have extended my stay in the hotel and the process was very smooth...I will come again and again to the hotel"
  },
  {
    "Review": "Sugeertharan and Anoj took good care of us and made sure we had a good experience, while every need was met."
  },
  {
    "Review": "Excellent food and services I came with my family for birthday dinner enjoyed well and also would like to the Indian chaff Veera and Silambu further the more I like to recommend this to all who "
  },
  {
    "Review": "Each time a vehicle enters the Cinnamon Grand entrance, there is an irritating loud clunky noise caused by a loose drainage cover near the security hut. The problem has been there for weeks and seems like the hotel staff hasn’t done anything about it.This type of noise pollution can be expected from a 2 star hotel, not 5 star ! Appreciate if you could fix it and confirm. Thank you."
  },
  {
    "Review": "Nirosh and wasalage Ruwan gave us a great service and always looked after our table. And the food was excellent as expected along with a great village vibe music. The ambiance and the cosy atmosphere definitely made it a good experience for our friends visiting Sri Lanka. Would definitely recommend it to anyone who wants to enjoy a cultural evening with traditional and authentic Sri Lankan cuisine.Had a great time thanks "
  },
  {
    "Review": "We were attending a convention in Sri Lanka and stayed at this beautiful hotel. The staff was outstanding in providing anything we needed. The rooms were extremely clean and comfortable. The food was totally amazing! We highly recommend this hotel and would definitely start here again."
  },
  {
    "Review": "Breeze bar is one of my favourite place in Colombo. Staff is very friendly and helpful. We felt very comfortable to discuss many things. Its lighting arrangements are very well done. We are pleased to come again and again."
  },
  {
    "Review": "Superb hotel! The room is so nice. We arrived in the evening so i decided to have room service. Would like to commend Roshan. He's so nice and accommodating.Keep it up! The breakfast is so good. The ambience is fascinating. Best regards! Will be back"
  }
]
