[{"date":"2018-06-19T00:00:00.000Z","text":"Have visited this place sometime ago but felt that a second review is called for because they have maintained their standards well. The staff is friendly and the food is still good and tasty","title":"A second visit"},{"date":"2018-06-18T00:00:00.000Z","text":"We dropped by Cafe Beverly around 7.00 on a Wednesday. There were only few occupied tables. We ordered few Thai dishes and couple of drinks. The service was fast but the food was bland. Also, we could not comprehend what the waiter was saying as he was using a different accent (on purpose we believe) , we had to ask a few times to understand what he was saying. Anyway, would like more flavour in the food.","title":"Mediocre"},{"date":"2018-06-11T00:00:00.000Z","text":"Though it had been around there for quite sometime and I'm working close by, it wasn't until this I stepped in to Cafe Beverly. My first impression on the restaurant was pretty good. It had nice interior, calm and secluded despite its positioning on the side of a busy road. Only negative thing about the place was that once we took a corner table, there were mosquitoes - a lot of them!The food - there's a good choice and very good in taste. I heard complaints that the portions are not enough for a regular-size eater, but I found the portions quite satisfactory and filling. The prices are reasonable as well. They do have a delivery service which could bring your preferred meal over to you. I'm yet to try that one, but I'm definitely in love with their dishes.","title":"Good dining, want to be back"},{"date":"2018-05-25T00:00:00.000Z","text":"The food was absolutely delicious. Nice place for a meal out. The service was excellent & convinient spot with parking.","title":"Delicious food & great service"},{"date":"2018-05-12T00:00:00.000Z","text":"I went there many times and had very good experiences.Cafe was excellent with superb food and and was super clean too.The restaurant staff was very welcoming and seemed eager to attend to our every need .The waiting staff were very polite, patient and helpful.They even went the extra mile by recommending the dishes to us.The food arrived pretty fast and was very very good.It was not greasy or oily and the presentation of food was commendable as well.One of the best restaurants around that area.If anyone wants to have a good meal which matches the price Beverly cafe is what I recommend.","title":"Great Ambiance with Delicious Food"},{"date":"2018-04-20T00:00:00.000Z","text":"Here they have dishes for all different requirements. For kids no spicy food, adults can have their taste. The taste get varied from dush to dish. The place is clean. Parking is available.","title":"Good food"},{"date":"2018-04-17T00:00:00.000Z","text":"A relaxing cafe in Colombo. We went on a weekend that was super busy but the staff was working tireless to cater to everyone. The food was good and there was a band playing which added to the positive ambiance. Would recommend","title":"The staff is exceptional"},{"date":"2018-03-14T00:00:00.000Z","text":"I went out to lunch with my friends here. The restaurant is very cozy. I ordered their chicken burger which I loved. The food took quite long to be prepared and served. The staff could improve their service. Overall it was a pleasant experience.","title":"Cozy Restaurant"},{"date":"2018-03-04T00:00:00.000Z","text":"Good food with various options, very pleasant environment and good people. Such a clean place priced for the value.","title":"Nice cafe with delicious food"},{"date":"2018-02-24T00:00:00.000Z","text":"Classy, relaxing restaurant with good service Good food with various local and international menu option and generous portions Ideal Hangout","title":"Various Menu Options"},{"date":"2018-02-03T00:00:00.000Z","text":"Good place for a meal and a chat. No alcohol, a 0% beer was on the menu though. Not too many local meals on offer - mostly eastern and western. Service was good. Good cafe type atmosphere. Carpark available with easy access.","title":"Nice cafe with good meals"},{"date":"2018-01-19T00:00:00.000Z","text":"I visited this cafe many times and they never disappointed me with the food. This is a very large space with a clear menu with wide varieties of mains drinks and desserts.","title":"Great ambience with generous portions"},{"date":"2018-01-18T00:00:00.000Z","text":"Food was great potions are ok as well some food are really spicy over all good place to hang out prices are very high...","title":"Dinner"},{"date":"2018-01-01T00:00:00.000Z","text":"This was the second time I visited this place with a friend (first time it was only for coffee). The steward who served us was Dinuka Madhushan. His service quality was at the international standards and was really friendly and most of all he knew the menu inside out. He recommended a fish based dish for my friend and a chicken based dish for me. Both the dishes were much better than we expected (perfectly cooked with an appropriate amount of spices) and despite it was a quite busy day, we received the food order within c. 15 minutes. After that, we requested Dinuka to recommend a dessert for us and he recommended chocolate chip cheese cake brownie, which was really nice as well.Overall, thanks to Dinuka we had an amazing dinner on a very special day :). We will visit that restaurant again for sure and try to get the services of Dinuka again.","title":"One of the best restaurants around that area with top class service"},{"date":"2017-12-23T00:00:00.000Z","text":"Indian cuisine is quite good as they have a north indian chef.Their Veg. Samosa is the best in n around Colombo till date though its looks costly for a plate of 2 pieces.Service is prompt &The restaurant overlooks Diyatha uyana park & with a beautiful view of Diyawanna lake.So, the best time to enjoy is lunch with the view.","title":"Nice ambience, nice food, nice shopping"},{"date":"2017-11-12T00:00:00.000Z","text":"Good range of food; tasty; quick;good service, good price and reasonably good ambience. Just what a good restaurant should be. Not try to reach too high, Just get the basics rightI don't think these guys are marketing themselves well. I had never heard of this place. Just accidentally dropped into see if I could buy a few shirts from their clothes shop and found this lace by the side.I did a bit of probing and found that they have a Thai and Indian Chef","title":"Pleasantly surprised with this restaurant"},{"date":"2017-10-28T00:00:00.000Z","text":"Love the food enjoyed the crab and egg noodles and The biriyani I had mutton so tasty authentic stuff will visit again","title":"Just for dinner"},{"date":"2017-10-04T00:00:00.000Z","text":"The food here is tasty.The ambiance is very good.The price similar to other ones.The service is good.The mutton buriyani is very good.","title":"Good"},{"date":"2017-09-27T00:00:00.000Z","text":"The food and service was excellent .Well located with ample parking. The lighting and atmosphere was good. I feel the prices are on the high side compared to similar Cafes \/Restaurants. Alcohol is not available but non alcoholic drinks were excellentOverall had a enjoyable evening.","title":"Dinner with friends"},{"date":"2017-09-05T00:00:00.000Z","text":"We tried the vegetarian Indian food and it was really tasty as were the butter naans although on the expensive side after tax and service charge is included. Service is also prompt.","title":"Delicious food"}]