[{"date":"2018-07-22T00:00:00.000Z","text":"Spent a night during last summer at the hotel with family and the experience was unbelievable,the Chinese restaurant at the hotel serve a great mix or fusion and Chinese food and the breakfast was served in the Taproban restaurant which served a mix of eastern and western cuisine in hotel and cold forms","title":"Shafraz mohamed"},{"date":"2018-07-22T00:00:00.000Z","text":"My wife and I checked into Room 925 on 7th July and Manager Chamila, assisted by Saldeen and the Butlers ensured that we had the best experience. We had a few guests coming to see us in the evening and the Team led by Chamila took good care to ensure that all the minute details were taken care of. All of us had dinner at the Taprobane that night and Udaya and his colleague on duty, Chef Sudath and the Stewards were exceptional. Good work Boys. Keep it up. We will come again and again. Deepal Jayamanne.","title":"Amazing Service on the Executive Floor"},{"date":"2018-07-22T00:00:00.000Z","text":"Recently I attended a workshop carried out at the Cinnamon Grand and happened to be there for 2 consecutive days. It was poor experience that I received from the point where I had to park the car. There is no indication as to where you have parking available in the basement and I was told the basement is reserved for staff but lower level is for customers. I was quite surprised to hear this. There was strangely a power outage for few minutes during our workshop and I was again surprised to notice that there was no back up power for sometime. My worst experience was the state of the washrooms as both ladies and gents wash rooms at the area (Angsana Spa) where we had our workshop was out of order. You have to walk a distance to find a wash room. The state of the wash rooms too were unacceptable for a five star hotel. Last but not least I was disappointed to notice the standard of the buffet laid out at the Taprobane restaurant. Food was lousy and tasteless. Sushi served in one corner looked stale and the sashimi definitely didn’t look fresh. The food served near the cooking area was hard to reach and the chefs who were supposed to serve were too busy chit chatting... to get a roast lamb cut I had to stand and wait to get the chefs attention. By the time we went for lunch it was around 1.30 pm and I also noticed that half the dessert items were over at that time. When I asked if the desserts will be refilled the manager at the restaurant said yes. However till I walked out around 2 pm the dessert items were never refilled. I was quite disappointed to notice the large scale deterioration of service and quality of one of the best loved 5 star hotels in Colombo.","title":"Cinnamon Grand not grand anymore"},{"date":"2018-07-22T00:00:00.000Z","text":"I visited for business and stayed at the Executive Lounge at Cinnamon Grand. The service was best in class. Lot of facilities like late checkout, afternoon tea and so on. Saldin and Stanislaus took really great care. Plan to visit this place again.","title":"Feedback about Executive Lounge"},{"date":"2018-07-22T00:00:00.000Z","text":"Wooooow Had a great time with friends after long time in colombo city, Friendly staffs, good food, quick services, nice dessert ,nice place to get south indian veg and non veg dishes felt like home, Chef Veera&silambu","title":"Lunch at chutney served by sugeertharan and ranil"},{"date":"2018-07-21T00:00:00.000Z","text":"My second time in Colombo but first time in this hotel. The level of service was average; the check-in took about 20 min. However the hotel itself is perfect for a business trip. The rooms are clean and the hotel is perfectly located. The lobby is beautiful and the food is OK. Restaurant Nuga Gama is recommendable if you want to try the local food.","title":"Great for a business trip"},{"date":"2018-07-19T00:00:00.000Z","text":"\"Great value for money\"Great taste food for comparatively very reasonable price. You should always call and reserve a table. The staff is one of the most friendliest I've ever come across. If you get lost on what to order always ask the staff and they will suggest a suitable one. Special thanks to Mr. Nilupul for the very friendly service you provided to our family!","title":"Noodles Restaurant"},{"date":"2018-07-19T00:00:00.000Z","text":"Stayed for first two weeks of July for a convention and from the moment we arrived we received professionalism and care from all the staff. This was impressive as the hotel was fully booked the whole time because of the convention. Tanya on Reception was especially helpful in a ‘saree crisis’.","title":"Superior Customer Service"},{"date":"2018-07-19T00:00:00.000Z","text":"We had the most fantastic meal and the best possible service here, the food is incredible and Sugeertharan went out of his way to make us feel happy and welcome. You should come here if you are in Colombo and fancy a treat.","title":"Dinner at Chutneys - Served by Sugeertharan and hifas"},{"date":"2018-07-17T00:00:00.000Z","text":"Great food, lovely atmosphere and excellent service by Sam! Highly recommend for authentic South Indian cuisine in Colombo. Make sure to make a reservation in advance as it tends to get quite busy even on weekdays.","title":"Dinner at Chutneys served by Sam"},{"date":"2018-07-17T00:00:00.000Z","text":"Room service Mr.vigneshwar he is very cooperative... nice servicing and friendly...Cinnamon grand hotel is my preferred choice in Colombo ...I have extended my stay in the hotel and the process was very smooth...I will come again and again to the hotel","title":"Room service"},{"date":"2018-07-17T00:00:00.000Z","text":"The buffet was varied and offered distinct flavours from different parts of India. Well recommended!Sugeertharan and Anoj took good care of us and made sure we had a good experience, while every need was met.","title":"Buffet Dinner at Chutneys served by Sugeertharan and Anoj"},{"date":"2018-07-16T00:00:00.000Z","text":"Nirosh and wasalage Ruwan gave us a great service and always looked after our table. And the food was excellent as expected along with a great village vibe music. The ambiance and the cosy atmosphere definitely made it a good experience for our friends visiting Sri Lanka. Would definitely recommend it to anyone who wants to enjoy a cultural evening with traditional and authentic Sri Lankan cuisine.Had a great time thanks","title":"Thanks 🙏🏽 nirosh nugagama"},{"date":"2018-07-16T00:00:00.000Z","text":"We were attending a convention in Sri Lanka and stayed at this beautiful hotel. The staff was outstanding in providing anything we needed. The rooms were extremely clean and comfortable. The food was totally amazing! We highly recommend this hotel and would definitely start here again.","title":"First trip to Sri Lanka"},{"date":"2018-07-16T00:00:00.000Z","text":"Breeze bar is one of my favourite place in Colombo. Staff is very friendly and helpful. We felt very comfortable to discuss many things. Its lighting arrangements are very well done. We are pleased to come again and again.","title":"Best service by Fahad and Nishantha"},{"date":"2018-07-15T00:00:00.000Z","text":"This is an excellent srilankan restaurant for family. The staffs are very friendly and this is the place to go if you want to experience traditional srilankan food and culture. Nirosh was very friendly and explained the Srilanken cultural very well. The music was exotic and i thoroughly enjoyed my day. Would like to thank to those two beautiful ladies who cook the meal for the day.","title":"Nugagama"},{"date":"2018-07-15T00:00:00.000Z","text":"Excellent and very courteous service.Food was also excellant food was very much good and special thanks to cheff veers and silambu who is made the food and excellent service from sugeerthatharan all ways thank You cinnamon grand","title":"dinner at chutneys served by sugeerthatharan anoj"},{"date":"2018-07-15T00:00:00.000Z","text":"Went for my father’s birthday. Great service. Lovely food. Superb ambience. Very attentive staff. Enjoyed the evening thoroughly. Thank you Muhammed & Sammuka & the team who served us! Will definitely come again.","title":"Excellent afternoon tea service given by Muhammad"},{"date":"2018-07-14T00:00:00.000Z","text":"I think this is a best hotel for wedding function..,And I really enjoy this evening with my friends and family . And other thing best service ever never get free m other hotel . If compared with other hotel this is best hotel in srilanka.. because of Stanislaus .. he did great job and . Service and recommend everything .. specially stanislaus and harshana chamindu and dhanushaka were fantastic!!! they are really awesome.. I love this hotel ..And chamindu also good .. special cocktail and food are marvelous I never had this much of fun and enjoyable day .. i will really recommend this place for my friends..Specially thanks to stanislaus and Travis casther and asanka amarasinga and team ..","title":"Banquet wedding function"},{"date":"2018-07-14T00:00:00.000Z","text":"Excellent service very efficient looks very pleasant great work keep it up all the best!!!!!food was yummy and v loved the spread had a great variety and non spicy food for the kid as well.Enviornment was so nice and calm hoping to see you all especially Anuradha,Sameera,Mr udaya ,Mr Disheera","title":"Taprobane dinner buffet"}]