[{"date":"2018-07-03T00:00:00.000Z","text":"Have just come from this restaurant had a great egg kottu It was just a nice home cooked one,our food took a bit of time but it was really worth the wait,really tasty nothing complain about that,good price also this is a family business, very small restaurant on the main road in mirissa but Would definitely recommend this place for others.TRY KOTTU","title":"The food was absolutely delicious"},{"date":"2018-05-10T00:00:00.000Z","text":"We have been in Sri Lanka for 4 days now and this was the only original local dish we've had.I had vegetable curry and rice yum!My friend had chicken kottu which he said was delicious.Good price would recommend. Doesn't look much but food freshly made and great service.","title":"Delicious"},{"date":"2018-05-06T00:00:00.000Z","text":"As others have said, do not be put off by the entrance to this little restaurant. We took a tuk tuk from Weligama Bay to try this restaurant out and we were not disappointed. When we arrived we were shown through to the back area in the garden of the restaurant where they quickly placed a plastic table and chairs for us to sit at. This restaurant is run by a husband and wife team. The husbands takes the orders and his wife expertly cooks your meals. When you sit out the back you can watch as the lady prepares your food. The chicken curry with vegetables and rice was fabulous. The cucumber curry, eggplant, mixed vegetables and off course coconut sambal which were the vegetable part of the dish were delicious. Yes the service may be a little slow but it is well worth the wait and very reasonably priced also. The lady who cooked our meal came over to make sure everything was to our liking and we assured her it was. We highly recommend that you give this little restaurant a go.","title":"A family run restaurant and a great place to eat"},{"date":"2018-05-05T00:00:00.000Z","text":"Excellent local food,I am enjoyed that local food ,is nice I am recommend that place enjoy .thank you, Dimali inn.....!","title":"Best rice and curry “Mirissa “"},{"date":"2018-05-01T00:00:00.000Z","text":"Really delicious home made local food. The couple that run this shop are so lovely and welcoming and the food was amazing and great portion sizes.","title":"Yummy!"},{"date":"2018-04-28T00:00:00.000Z","text":"I have to admit that this place is not much to look at from the outside but don't let that put you off. Delicious home cooked food. The hosts are so welcoming and friendly and the portion sizes were generous. The ingredients are all fresh and grown in the back garden. We had the vegetable curry with rice and a prawn curry that were absolutely delicious. I would highly recommend a visit if you are in Mirissa. You won't be disappointed!","title":"Best curries in Sri Lanka"},{"date":"2018-04-23T00:00:00.000Z","text":"Wow! I Just expected this little tiny place, First i walked Trough, cant find it haha. You can watch her cooking and have a nice Talk about traditionell food . Nice big Portions, perfect for Lunch. Thank you","title":"Great home style"},{"date":"2018-04-21T00:00:00.000Z","text":"Not much to look at from the outside but as soon as you step into the garden it’s like being in someone’s home.Some of the best curries we’ve had in Sri Lanka. Delicious vegetable platter with rice, aubergine, okra, green beans, dahl and poppadom... a complete bargain at 550 rupees!Lovely couple running the place were very friendly and offered us seconds when we’d finished off our plates. Couldn’t recommend more!","title":"The best home cooking in Mirissa"},{"date":"2018-04-16T00:00:00.000Z","text":"We were welcomed with huge smiles and led to the garden (plastic tables and chairs). We ordered pineapple juice, mixed juice, egg kottu and two veg curries with rice. Then the family jumped into action and started chopping things and cooking things. The kottu was just brilliant. It was all FANTASTIC! They asked how spicy we liked things and then brought us some chilli sauce on the side. We had aubergine curry (sticky and sweet), okra curry and dahl and a freshly cooked super puffy pappadom. So pleased we chose to go there. It was great value too!","title":"Absolutely delicious!!"},{"date":"2018-04-16T00:00:00.000Z","text":"I got the recommendation for this from my sister who ate here a couple of years back. And it lived up to the laudation!! One of the best curries I had so far here in SL.It looks a bit shabby from the outside, but just go and sit in the backyard where it’s nicer.","title":"Super good curry"},{"date":"2018-04-13T00:00:00.000Z","text":"We were really looking forward to coming here after reading all the reviews but we're quite disappointed. The vege curry lacked alot of flavour and was disappointed compared to other Sri Lankan restaurants have visited.","title":"Disappointed"},{"date":"2018-04-12T00:00:00.000Z","text":"Great place to go for authentic rice and curry. Really tasty and they give you loads (and offer seconds of the rice and veg). Very friendly people. It’s all a bit basic but the outside garden where you eat is a pleasant place to sit.","title":"Lovely authentic Sri Lankan curry"},{"date":"2018-04-11T00:00:00.000Z","text":"Delicious food by a Sri Lankan “Nonna” (if you will) so friendly - went back to eat several times when in Mirissa. Doesn’t look like much from the outside but don’t let that fool you ! Try it 😊","title":"Amazing home cooked food"},{"date":"2018-03-30T00:00:00.000Z","text":"My husband and i arrived and were a little unsure however we were not dissapointed! These guys do the restaurant thing well! Incredible food, MASSIVE potions and incredibly friendly :) dont judge the place by looks!","title":"Wonderful"},{"date":"2018-03-26T00:00:00.000Z","text":"A very basic Sri Lankan restaurant with exceptional homemade curries. Good sized meals and tasty curries. Lovely staff too","title":"Awesome curries"},{"date":"2018-03-21T00:00:00.000Z","text":"We had here a dinner 2 times and all times we were happy! The portions quite huge, it was tasty, the juces were perfect made! The owner very warm and carefull man. Although the place doesn't look nice, the food here is really good!","title":"Good food"},{"date":"2018-03-19T00:00:00.000Z","text":"My friend and I were told to eat here by a friend we met in Mirissia and we are so happy we did! We ate here maybe 5 or more times in our 7 day stay in Mirissa, and if we didn't eat here we thought about it all day! You can expect flavorful, fresh food and leaving with a full belly and full heart. Really, lovely dishes and great conversation with the family who runs the place :) Thank you again! We will be back soon!","title":"Must eat!"},{"date":"2018-03-18T00:00:00.000Z","text":"Mom and a daughter are cooking up good authentic Sri Lankan food. We drop in a few times and ordered curry and rice with veggies\/chicken—a good sized portion for 650\/700R. We had to wait for a while but the food was fresh and tasty.","title":"A family-run restaurant"},{"date":"2018-03-17T00:00:00.000Z","text":"Warm welcome but went down from there.Expensive menu.Table by the road.Average vegetarian curry and rice.When bill was presented had been overcharged=I had to show them them their own menu to get a grudging change in costings.Will not be eating there again as nothing like the previous reviews we had read.","title":"Disappointed"},{"date":"2018-03-07T00:00:00.000Z","text":"Don't be put off by the entrance, which looks like you've not come to the right place (a side alley with tables in it). Once you walk through you're in a families garden and it's really lovely and homely. They're such nice people and all do the cooking together. The food was delicious and a big portion (I couldn't finish it all) would have gone back if we had found it earlier. Thank you for a lovely meal x","title":"Really pleased we walked through to the back"}]