[{"date":"2018-02-17T00:00:00.000Z","text":"Recently one of my collegues decided to deliver lunch from a this Thai Place named Fat Panda, which is in Sea Avenue, Colombo 03, with a new Thai chef we've got some rumours about and we did order few dishes after checking out their menu from their Facebook page. We ordered Pepper beef, and Khai Luk Keeuy (The so called Thai Son-In-Law eggs, the eggs with Tamarind sauce dish) and mixed sea food rice. Our order go delivered within half and hour and my friend was super excited of it. We were all calm and quite and doing our work until our friend decided to peek in to the food. My mouth still water to the yummy smell I got from the food when he opened one dish and all of us were tempted to eat.First I must say despite ordering for only one person the food we got is a quite surprising. The rice portion was quite enough for two people and the curries could satisfy almost three people. And the taste never disappointed us. Cooked with authentic thai herbs and spices our tastebuds never got tired of eating it. Each and every bite tempted us to eat more and more and we couldn't stop but wish that we ordered more and more. I've heard that they are blessed with a Thai chef who gives everybody the Authentic Thai experince and I must say Thanks to her as well. We are looking forward to order again and again from Fat Panda, and hope for the best that they would keep on surprising us everday!","title":"The Best Thai food in the City"},{"date":"2017-11-19T00:00:00.000Z","text":"We visited for dinner and we were the only dine in people at the restaurant. Restaurant is in two blocks away from marine drive in a cross road. Service is good and as we were the only people they expected for us to finish dinner soon to close the restaurant. They never requested it from us but body language showed it.Crab sweet corn soup and Kung pao prawn were good. Others were average. They have their own version of food. Those are not authentic or similar to local version of food. This place BYOB free and they offered a 15% discount. They charged 10% service charge but not vat or nbt.","title":"Good Service"},{"date":"2017-09-15T00:00:00.000Z","text":"As mentioned in the title it is a very calm and quiet restaurant. Their welcome and the service is very attractive. At the first glance we saw it as a very small place but it's wrong.I recommend this place for Chinese\/Thai\/Singapore foods.One bad review is, they don't have car parking when it's crowded.Nice place and people.","title":"Calm and Quiet place with delicious food."},{"date":"2017-08-27T00:00:00.000Z","text":"We just had a fabulous dinning experience at FAT PANDA .I must undoubtedly recommend this restaurant features wide selection of Asian cuisine to Asian food cravers. These individual mouth watering dishes carry its authenticity we had Hot Butter Cuttle Fish , Crab rice and etc which awakened our taste buds.During weekend many people flocked to taste this variety of Asian cuisine.The ambiance has created such a way where you can dine in a confined area of your own as a family these family rooms are awesome and soothing piped music enhance the dining experience.Service is fantastic and the Fat Panda Team never let their smile to go away from their faces.","title":"EXCLUSIVE FOOD"},{"date":"2017-08-25T00:00:00.000Z","text":"i was there for dinner with my family and found food was very good and nice people serving food . I have no problem of recommending this place to any one who love asian cuisine .","title":"Great food"},{"date":"2017-08-24T00:00:00.000Z","text":"Very nice friendly staff I recommend this restaurant highly enjoyed with food which was my second time & will never go any ware else if I'm in Colombo. Food was excellent, everything from beginning to an end.","title":"Excellent Food"},{"date":"2017-08-24T00:00:00.000Z","text":"I have visited panda last week along with my two little once. amazing food and Cuttlefish was superb. Ramanayaka had gone out of his way to look after our table my kids had beautiful time at Fat Panda.reasonable price and loved presentation with speedy services.we will back soon please continue the similar services without any further shortfalls.thank you Ramanayaka.","title":"\"Wow - We loved panda\""},{"date":"2017-08-22T00:00:00.000Z","text":"Went on a Sunday night, only us were there. Food is overpriced. Portion is small. But the food is ok, tasty. Service is good and fast.","title":"Overpriced but tasty"},{"date":"2017-07-31T00:00:00.000Z","text":"You always need to be a bit smart when using TA. If everyone says the place is amazing, but they have only ever written one review, then you need to be suspicious, but on this occasion I slipped up on my own advice. Yes the restaurant is well decorated, nice furniture and the service on the whole was good, however I do hate waters 'hovering' until you finish. However, the food was a massive disappointment. The Thai soup tasted nothing like it should and the Singapore noodles were over cooked and tasteless. If this place is to be a success in the future, it will need a new chef. I had intended ranking this restaurant low, but having spent the whole night in the bathroom after eating there, than it has to be ranked even lower!","title":"Poor food"},{"date":"2017-07-27T00:00:00.000Z","text":"Hot butter Cuttle Fish - On Point ! ... Staff - Very kind very friendly... Desert - The Panna Cotta itself is worth the drive...","title":"What a spot !"},{"date":"2017-07-20T00:00:00.000Z","text":"We were quite excited to go to this place. But the food was a total disappointment.Everything we ordered tasted horrid. From the smell of the food to the taste, it was just bad.Service is good. The waiters were nice. But I doubt there is anything they can do about the food. It's just bad. Change the CHEF!!!","title":"Horrible"},{"date":"2017-06-28T00:00:00.000Z","text":"Tucked away from the hustle and bustle of the city just meters away from Marine drive in Colpetty the Fat Panda is an ideal place to catch up with friends. From the outside it looks unassuming and tiny but they have more dining space upstairs. Love the decor, specially the wallpaper (not going to divulge what it is you have to see it to appreciate it....or not!)","title":"Great place to catch up with friends."},{"date":"2017-06-27T00:00:00.000Z","text":"Nice little dining place, ideal suited for lunch and dinner. It's located a little hidden of the coastal road in Columbo. The service was very pleasant and attentive. We've enjoyed the food. Starters and desert was very nice, the main dished are nice too, but average ...nothing that will stick out. The ambience would need a little touch up, since it did remind us of a food chain. Although everything was nice, we do have to mention their fly problem. 3 of them circling our food and drinks as all times, was a bit much. Overall it's a better fast food restaurant and should be rated like one. Strictly no Pandas present!","title":"No Pandas ...but you'll leave as one!"},{"date":"2017-06-26T00:00:00.000Z","text":"Good atmosphere, calm and welcoming. Friendly staff. The \"jungle cooler\" mocktail, combination of pineapple, passion and coconut cream actually has a strong taste of coconut cream in it which gives it a unique taste of its own. Yummy \"sweet and sour chicken\" is good for any meal, regardless of you having lunch or dinner. But truth be told, \"hotbuttercuttlefish\" is a dish you must not miss if you ever visit here. It has it taste that can satisfy your taste-buds immediately which is out of the world. Best of of the best that I've ever had. FAT PANDA is a must visit Asia Fusion restaurant in Colombo.","title":"A must visi restaurant in Colombo"},{"date":"2017-06-25T00:00:00.000Z","text":"Had an amazing lunch with some of my friends last week, The food was exceptional. The Shrimp salad, crab rice and Malay chicken were impressive.Really enjoyed the service provided by the staff and they were super friendly and kind. A Must try out place in Colombo for lunch or dinner and i would highly recommend this spot.","title":"Exceptional Asian Fusion cuisine"},{"date":"2017-06-20T00:00:00.000Z","text":"The fusion cuisine of thai blended with an Indonesian kick was both delightful and quite an exquisite dining experience. Really enjoyed the service and the friendly staff. Red room was something new, and really liked the vibe,and the Tom Yum, Beef Salad,Prawn and the desserts were better than Poh's Noodle Soup. Very reasonably priced and super location. A must try if you are in Colombo.","title":"Fat Panda - The Real Fusion Warrior"},{"date":"2017-06-20T00:00:00.000Z","text":"Had a fantastic evening here with some friends this week.The food was exceptional. Very impressive since there is a huge option of all sorts of different asian cuisine. You can have some thai green curry or some hot butter cuttlefish. The varieties are endless.Over that the service was just remarkable and the place was extremely clean and the pricing was extremely good for the quality of food you get. There is plenty of parking just next door since its off Marine Drive. Will most certainly head back soon.","title":"Great food, service, ambiance !"},{"date":"2017-06-16T00:00:00.000Z","text":"Dined at Fat Panda a few of times and it's been a great experience each time.The shrimp starter was the best... Beautiful mix of flavours. Loved the cuttle fish too.Between the few of us I have tried quite a few dishes ... All of what's in the menu was still not available and I look forward to trying them all! Of what I have tasted most dishes were fabulous.The Mutton Panang was a little hard on the first day but perfect on the second. Didn't feel the Pad Thai was authentic though very good.The menu needs a bigger font :-)My absolute favourite is the Berry Panacota would go there just to have that.The quality of the food and its presentation is very good and I felt it was value for money as the prices were inclusive of alltaxes and charges.The service, staff and the ambiance was exceptional and I am waiting for their rooftop to be operational. Think that will be a great hangout spot after sunset.","title":"Fresh Fusion!"},{"date":"2017-06-15T00:00:00.000Z","text":"Dropped in for lunch on a workday and really enjoyed the calm & quiet ambiance of the restaurant.The menu consists of a fairly decent selection of Asian Fusion dishes and the food was great. Loved the delicious hot butter cuttlefish. The time taken to serve the food could improve. However the staff were warm and friendly.Would recommend it as a nice and quiet place in the midst of the hustle and bustle of Colombo for a good meal with family, friends or colleagues.","title":"A quiet place to have a good meal in Colombo"},{"date":"2017-06-15T00:00:00.000Z","text":"When me and my colleagues were getting to office after a meeting we had to hunt for a place for lunch as we all were in a mood for some seafood in a convenient location. This place attracted us with the very catchy name \"Fat Panda\" in sea avenue and a very few meters from marine drive. we were so happy when going through the menu and i must say great mix for every taste bud. we ordered the Crab Fried Rice, Singapore Chili Crabs, Sweet & Sour Chicken,Hot Battered Cuttlefish.we all really enjoyed every single dish we had. A great meal and love going to this place again and again. Friendly service by the staff and the ambiance really impressed us.great place for a happy meal.","title":"Good food with great service"}]