[{"date":"2018-07-23T00:00:00.000Z","text":"We stayed one night at the end of our Sri Lankan Tour. The location is excellent, right on the waterfront and across from the Old Parliament Building.Our room overlooked the Parliament Building and the waterfront, however the view is spoiled by the huge construction site across the road.The room was large, but is need of a refurbishment. The carpet looked shabby, the bathroom fittings are old, chipped door frames and everything looks \"tired\".We did order room service dinner and the meal was delivered quickly and food delicious, tasty and reasonably priced.Breakfast the next morning was adequate with a wide selection of options available.We visited the Pool area and this definitely needs renovation attention.Staff are friendly and helpful when we asked questions.We decided to visit old Colombo district and were recommended not to pay more than 150 rupees for a Tuk Tuk ride to the Red Mosque. A great experience to wander around the laneways and streets of the old city.The Hotel is in a prime location and could benefit from some refurbishment.","title":"A lovely hotel needing some \"TLC\""},{"date":"2018-07-20T00:00:00.000Z","text":"It is a beautiful old Hotel with a brilliant location. The rooms are nice. The food is great and the views, esp of the old parliament are awesome. We spent a night there and enjoyed every minute. Highly recommended","title":"Beautiful city hotel"},{"date":"2018-07-15T00:00:00.000Z","text":"Reception and service of hotel is excellent.Rooms are big in size they have many restuarant as well as bar.Food is very tasty.specially breakfast was covering most of dishes where you can have your lunch.very comfortable stay.","title":"comfortable stay"},{"date":"2018-07-12T00:00:00.000Z","text":"WE stayed here on our last day in Sri lanka. Its one of the old style hotels with large rooms and antique furnitures. The staff is courteous but a little improvement in english speaking can be a added feature. One of the main highlights for us was the food. The dinner buffet was extravagant keeping in mind the kind of tourists they get. There was chinese, continental and indian spread. My parents were happy as they could devour some vegetarian indian food. Also we ate the next day at their indian restuarant which was superb and very much indian in their flavour. Overall a good experience and a must recommended place in colombo","title":"The best of Colombo"},{"date":"2018-07-11T00:00:00.000Z","text":"Mainly Arabic food . Quality back ti the past standards( quality of food had detioriarated in the last few years). This year the food was excellent . S great place to visit during fasting and for Arabic food lovers","title":"Ifthar Buffet at Sherazade"},{"date":"2018-07-11T00:00:00.000Z","text":"good to stay , hotel is very near to the beach & main city ,we can walk around to the beach area and food was good. Near to the market area . We purchased the spices. View was good and no pollution , near to railway station.","title":"it was god experience"},{"date":"2018-07-09T00:00:00.000Z","text":"We stayed in galadari for one-night and the hotel needs a serious upgrade. Everything from exterior to carpets looks extremely old. Breakfast is also not great! I will not recommended this place for sure","title":"Seriously needs upgrade!"},{"date":"2018-06-29T00:00:00.000Z","text":"On the 28th of this month I hosted a dinner along with my family for 14 of our friends at the California Grill, the fine dining restaurant at Galadari Hotel. It was truly a wonderful experience. The staff including the Manager of the restaurant Mr. Jayatunga went out of their way to plan a menu for the vegetarians as well as the non vegetarians, with the final approval from me, of course. From the time we arrived in the evening, we had extremely personal service from Mr. Jayatunga and his friendly staff.The setting of the restaurant was idyllic and we were instantly delighted on entering the restaurant. It was perfect, the decor was elegant and provided a very intimate setting for us to enjoy our meal.The meal itself could not be faulted. The food was excellently prepared and presented, and service was first class. It is important to note that the price of the meal was very reasonable.I would like to thank Mr. Thushantha Kariyawasam, Director of F & B at the hotel, under whose personal supervision all the arrangements were made, and Mr. Jayatunga, Mr. Yohan and others at the restaurant and Chef Anushan for providing myself, my family and friends with a truly magical evening in a lovely setting.It is gratifying to note that that the superior standards of this fine dining restaurant have been maintained right through the years.","title":"Dinner at the California Grill"},{"date":"2018-06-28T00:00:00.000Z","text":"The place is ok. Although why its called coffee shop when it serves main meals I have no idea. But all the restaurants are huddled together and that spoils the ambiance.The food was good and there was variety among the dishes and the staff were efficient.Overall a good place","title":"Dinner at Coffee Shop"},{"date":"2018-06-23T00:00:00.000Z","text":"It was great to visit Galadari again, it’s ok stay and good restaurant.Will recommend but overall price is bit high compare to the quality.Need little attention to detail in this time in time.New hotels are well established now.One downside is construction outside is way too much.","title":"Nice"},{"date":"2018-06-21T00:00:00.000Z","text":"We are not that much happy about food...food was not hot & tasty & fresh..and staff is not friendly.they are doing clearance olnly.there were few gentlemen with full suits.i think they are managers or supervisers...we tried to give our feedback to them.but we could not....finelly could find a smilly face he is VERKISE. Thank you verkise u changed our mood n that time...Thanks","title":"Had high tea"},{"date":"2018-06-07T00:00:00.000Z","text":"I visited the Cafe 64 this evening (7th June 18) to buy a snack and I came across a beef savory pastry named \" Pasthol\" it's basically a Pattie with Tripe (Babath beef). It was the worst Pattie I have ever tasted. Salty, very less Tripe and filled with Potato. The inside was mushy and has raw pastry. they sell this item as a promotional item for \"Ifthar\" and I feel sorry for the hungry customers who comes for break-fast. I have attached a pic for better visual experience. I'm not reviewing the Hotel, only the pastries at cafe 64.","title":"Worst savory pastry I have tasted - Cafe 64"},{"date":"2018-06-02T00:00:00.000Z","text":"Excellent hotel in the heat of Colombo. all the restaurants provide really tasty foods and especially the cafe 64 is really good if you are in a hurry to have a meal. their sawan is unmatched with any other.","title":"Excellent"},{"date":"2018-06-01T00:00:00.000Z","text":"I usually go to Barnesbury for shisha and wanted to try a shisha in a different place and found out Galadari has shisha Came once and liked the place. Kalpika is a very nice guy who makes the shisha. Serves me and my friends very well. I would recommend everyone to come here. Shisha is 1510 as wel","title":"Good shisha and service"},{"date":"2018-05-29T00:00:00.000Z","text":"This hotel is exceptionally poor . In desperate need of renovation . Every room I was shown smelt revolting ( mould ) with old shabby furniture and stinky curtains. The room looked like something from the 70's. The carpets simply haven't been cleaned for years. The towels smelt of bleach with frayed edges. Its not enough just to have a nice view and pretty helpful staff which it has but for a $100 USD a night plus 30% taxes its terrible. The food is pretty excellant in Sri Lanka but Galadari failed to deliver even a decent breakfast. Better hotels are the Cinnamon Grand ( worth paying a little xtra ) and the Mandarina Hotel further down the Galle Road.","title":"Overpriced, grubby hotel with extemely poor standards"},{"date":"2018-05-26T00:00:00.000Z","text":"Stayed in the 10th floor . Rooms had awesome view of the ocean front. Rooms are very large and palatial . Morning breakfast was excellent with good spread. Only regret was the hoppers also had egg which made vegetarians uneasy.","title":"Excellent stay"},{"date":"2018-05-24T00:00:00.000Z","text":"The hotel is located in the prime area very centralised. Fantastic staff and friendly. Excellent quality of food. They have a restaurant the California Grill..it has simply the best and amazing English food I have ever tried. Their coffee house has an extensive buffet truly value for moneyI would definitely recommend this hotel to travellers for a comfortable and pleasant stay and dining experience","title":"Wonderful Experience"},{"date":"2018-05-21T00:00:00.000Z","text":"A nice hotel, in a very good and safe area of Colombo. Polite and helpfull staff, good and big choice of food. Very near is Dutch Hospital area where u can eat and drink and spend a nice evening.Rooms are quite big, clean and comfortable. Reccomended for both pleasure and bussines.","title":"Good"},{"date":"2018-05-14T00:00:00.000Z","text":"This hotel needs major renovation. The rooms have very dated and worn cane furniture and carpets that need immediate replacement. The bathroom fixtures are all rusting, the tiles in the bathroom are very dated and the inside of the bathtub is stained and peeling. The carpet in the corridors is all worn that you can feel the concrete floor beneath. The gold plated elevator doors are disgusting and rusted. The only area that looks nice in this hotel is the lobby area. The breakfast buffet is reasonably good but could be better. The hotel is in a good location but not worth the money. This is definitely not a 4 star as it claims to be. It is no more than a 2 star considering the condition of the rooms. Even a 2 star in the US is a whole lot better than this hotel. I would not stay in this hotel again and I don't recommend it to anyone who is looking for a 3 star or above. This is a budget hotel and therefore, demand a budget rate.","title":"Needs major renovation"},{"date":"2018-05-13T00:00:00.000Z","text":"We go to Galadari high tea quite often as we like the variety they have. But today we had n unpleasant experience. I was there with my relatives for high tea. Afterwards we wanted to take a picture together as one of them is leaving the island tonight. We kindly requested an employee who was standing idle at the lobby to take a picture of us. For our utmost shock he was very offended and replied rudely saying \"ask a security guard to take pictures\". We have never taken pictures there before but this time, it was an important memory for us. When we asked another employee, he too went away but very politely saying that he was busy. We can understand that. But regarding the first incident; I must say that we never expected such rude reactions by an employee at Galadari where we used to consider so homely until today. :(","title":"Poor service"}]