[{"date":"2018-11-13T00:00:00.000Z","text":"Hotel is located in the heart of Colombo city. The hotel has a majestic facade, big rooms, but the overall feel is that the hotel needs renovation. Food is ok. The room size is big, the service is ok.","title":"Average Hotel"},{"date":"2018-11-11T00:00:00.000Z","text":"Located centrally. We were a big group. Rooms were good. Lovely view from my room. Bathroom decent. Room service average. Staff at checkin counter were very helpful and gave good advice on where to go and what to do. Food was average....breakfast spread was big. Everything was accessible from hotel location.","title":"Central location"},{"date":"2018-11-10T00:00:00.000Z","text":"I can clearly see that it was a top hotel at one time, but it is definitely starting to slip. Lot of the finishes are more than a little worn and the rooms are short on the latest amenities. But, it does have a great location and their prices were reasonable.I did not find the staff to be particularly friendly or helpful.","title":"Fading glory"},{"date":"2018-11-01T00:00:00.000Z","text":"Stayed in this hotel as part of a custom made tour around Sri-Lanka. Flight got into Sri-Lanka at 4am so room wasn't ready (check in was at 2pm) so my tour guide arranged an early check in (an additional 40 dollars) Apart from initial problems as the bed linen not being changed and the toilet not flushing (consequence of an early check in I guess) the service I received was brilliant. Staff opening lift doors for me and my girlfriend, showing as around the facilities and just being generally nice and prompt. But the crowning jewel was the food..... Seriously the breakfast buffet and the dinner buffet selection needs to be seen to be believed! Amazing choice and great tasting food. I have never seen such a spread in the many hotels I have frequented over the years! In addition the pool was pretty good, overlooking the parliament building in Colombo. All in all, a great experience just a tiny bit marred by my early check in.","title":"Food is ridiculously good"},{"date":"2018-10-29T00:00:00.000Z","text":"Have stayed at this hotel a few years ago and had good memories of this hotel but in this trip found this hotel to be very average. The only positive is that it is in a good location and friendly staff. However, the hotel facilities are quite poor. Rooms and facilities require a major overhaul. The air conditioning in the room was very bad. Overall a very average experience especially for the price paid.","title":"Colombo visit"},{"date":"2018-10-28T00:00:00.000Z","text":"The Galadari is a sort of every man's high tea. The food is something to run home and talk about, most of it is average, and none of it is bad. If you're just really hungry, there's the option of skipping lunch and just heading for this (we assume this is what most of the people here were doing, judging by the hordes), because essentially for Rs. 1800 you get to eat a lot of food. If you are a food lover and love to try various foods this will be a good place to you. Food is not Bad actually but we cant rate as superb.","title":"Galadari High Tea"},{"date":"2018-10-08T00:00:00.000Z","text":"TBH i didn't expect the dinner at Galadari would impress me this much.comparing with the 05 star hotel dinners this is something really good. The spread is good, good meat items + vegetarian items, which serves anyone. the price is all worth it.French Onion soup was a let down, which tasted like sini sambola water(Sinisambola is a Sri Lankan dish) but the cream soup was really good.Salad Bar - Had a pretty good selection. Im happy that they had smoked salmon. the beef salad was so good.Main course - Great! meat, pasta, rice, Sri Lankan style food, so many choices. the taste was surprisingly good. i had bits but i tasted.i honestly wish their dessert bar could improve a bit more. like chocolate mud cake would be nice. or they can improve their bread pudding.overall i think this is worth going for!","title":"Dinner Buffet!"},{"date":"2018-10-02T00:00:00.000Z","text":"We stayed here for two nights on the 16 & 17 August.The hotel is nice, rooms adequate however the buffet spread was the best of all the places we stayed. With such a wide spread it would have been nice to have clear marking of vegetarian and non vegetarian food as we had to keep asking all the time and since eggs are non vegetarian it was all the more challenging.The location of the hotel is quite strategic near the beach and the shopping is also just a few 100 meters away.Their tea shop has a wide variety of teas and at very reasonable prices. As a matter of fact their prices were significantly lower than some of the tea we purchased in the tea gardens that made us feel really cheated.","title":"Nice functional hotel"},{"date":"2018-10-01T00:00:00.000Z","text":"When there few weeks back with friends of mine and their high t is great. It is a buffet type and there were a lot of selections and variations. Quality food as well. You can easily find the place and they got enough parking spaces as well. Really love to go there again.","title":"Superb High T"},{"date":"2018-09-22T00:00:00.000Z","text":"ヒルトンホテルに並ぶ歴史あるホテルですガラダリが、全体的古いので、近隣の近代的ホテルに比べて見劣りします。水回りなどは、近代的ホテルの方が断然いいです。目の前の道路沿いのテラスで一杯やるにはいいですが、中国企業の港湾埋め立てが進んでいるので、いい眺めの海は期待できません。残念です。埋立地に近代的25万都市ができるので、そこに立つホテルが最高の眺めになるでしょう！Historic hotel lined up with Hilton hotel Garadari is overall old, so it is inferior compared to the neighboring modern hotel. The modern hotel is better than the water surroundings. It's nice to have a drink on the terrace along the road in front of you, but since China's reclamation of harbors is proceeding, we can not expect a sea of good view. I'm sorry. The landscaped area will have a modern 250,000 cities, so the hotel that stands there will be the best view!","title":"ロケーションは最高にいいです"},{"date":"2018-09-21T00:00:00.000Z","text":"This hotel is located in the heart of Colombo. You can have a view of the sea and the city at the same time. This is a neat and clean place. Buffet breakfast has a wonderful spread. They have nice crab preparation at dinner. In less than 5 min you can walk to the beautiful seaside promenade. Though in the evening promenade becomes crowded, yet it's fun and experience.","title":"Great location"},{"date":"2018-09-19T00:00:00.000Z","text":"Good hotel. Great location and view. Very conveniently located and a nice place. Rooms are large and ambience is good. Furnished old fashioned but overall a great place for a stay. Breakfast spread is average. Overall value for money.","title":"Nice place"},{"date":"2018-09-14T00:00:00.000Z","text":"we've stayed in the hotel for one night. the perfect location with a direct view of the ocean and the city skyline.5 minutes walk from the \"dutch hospital\" tourist destination.the rooms are spacious, but the furniture is obviously outdated.the staff are friendly, and the buffet is 10\/10.I bet it was the number no 1 hotel in Colombo 10 years ago.but for now, this hotel needs refurbishment ASAP.","title":"best location, but outdated hotel"},{"date":"2018-09-14T00:00:00.000Z","text":"Our resting place in Colombo. everyone is always busy but wonderful place to live in.Located at the center of the Colombo. Many of the top hotels are situated beside this. you can enjoy the waves of indian ocean from your window or can walk around the galle face road to experience the sun set.You can enjoy traditional, arabic as well as continental foods in dining. Big Rooms and friendly stuffs.","title":"majestic"},{"date":"2018-09-10T00:00:00.000Z","text":"Good hotel at a good location. Lobbey is excellent. Staff is good. Rooms are old bit quite big. Excellent sea view from room. Amenities in room are not enough. The girl on reception not treated nicely when we checked in on 8th sep around 10am. She was rude to tell wi fi. All other staff was very good during our stay. Overall a good but old five star hotel. Comfortable stay.","title":"Excellent view from room and good location"},{"date":"2018-09-03T00:00:00.000Z","text":"Hotel is located in a convenient and safe area. Staffs were friendly and helpful. We suggest them to go for a total renovation. Otherwise it’s not worth for the price. But building interior seems very old.","title":"Good location"},{"date":"2018-09-01T00:00:00.000Z","text":"I stayed in the Galadari for 5 days to attend a conference. The hotel is centrally located, but it is a bit old, so rooms may need upgrading, including change of carpet and headboard. The breakfast buffet was a good assortment of breads, fruits, local dishes were available everyday. The staff were attentive and friendly. There was a whole week of simultaneous conferences but they tried their best to respond to their guests needs. I was glad there was a Tea centre shop in the lobby, which solved our tea shopping needs, and the prices were same as malls including a 5% discount for checked in guests. The dutch hospital mall which had restaurants was a 2 minute walk. The room which we had a view of the beach. It was a relaxing stay.","title":"centrally located, nice views of the sea, friendly staff"},{"date":"2018-09-01T00:00:00.000Z","text":"Located in the Best place where all the important office and restaurant are in. Building is very old. But recently inaugurated restaurant is very beautiful. I loved \"Hot Lime Juice\". Lobby is little small for a big hotel.","title":"Hotel for Business"},{"date":"2018-08-30T00:00:00.000Z","text":"Excellent service and good food, packaged nicely. Take-away large order. Recommended for any outside catering. No advance amount charged too. Friendly and well empowered staff. We had a few health related conferences and we had a similar experience.","title":"Excellent Service"},{"date":"2018-08-30T00:00:00.000Z","text":"me, my wife and our son stayed in this hotel during August 2018. I had high expectations about our stay as it was my fourth visit to this place and they always treated me well. When we arrived at the hotel nobody was there to receive us and we had to wait long hours in the lobby moreover They have n't served us a welcome drink which was included in our package. We booked one triple room with Sea view for a daily rate of $150 but they have allotted a double room and provided one extra bed which was unacceptable. After heated arguments with the manager, they have promised to give a triple room but they never fulfilled their promise. We had to stay all three days in that congested room having paid $150 per day which is a sizable amount. We had to ask multiple times for services like filling the tea\/ coffee sachets or cleaning the rooms etc. When we had a problem with the heater in the room we contacted the reception to fix it and no one turned up until we went to the reception and shouted at them. Overall we had a terrible experience and we won't stay in this place again.","title":"Disappointed !!"}]