[{"date":"2018-07-20T00:00:00.000Z","text":"Best place I have ever stayed in Colombo. I have been traveling to Colombo for years. Usually stayed in Hilton of Cinnamon Grande, as Galle Face was under reconstruction.The refurbished Galle Face is beautiful. But personal service is excellent at all levels and appears 'sincere' in comparison with the other hotels I have experience of in Colombia. Not sycophantic, but humorous and very personable.This is a really special hotel. Whilst not a Spa person, the upgraded amenities are the best I have experienced in many hotels.","title":"7 - 16 July Stay"},{"date":"2018-04-29T00:00:00.000Z","text":"What a gracious old hotel! Everything about this establishment is old world charm and professional service. Colorful uniforms, friendly smiles and greetings from everyone. Sea views from many parts of the hotel and the ever present sound of the surf crashing on the sea wall at the edge of the green. Excellent buffet for breakfast - if you haven't tried it do have the egg hopper and accompaniments (well if you have tried it - have it again). Bars, restaurants (including what we were told is an excellent fish restaurant right by the sea), balconies to sit and take in the sunset, a pool and sunbathing area, a library (with books to be borrowed), wifi, a small museum etc, etc.ATM's around the corner to the right and a supermarket in the basement of the shopping centre next to the Cinnamon hotel (opposite side - cross Galle Rd at designated crossings - and yes the traffic mostly stops for you but take care).You will enjoy staying at this hotel and feel sad to leave.Transport and tours can be arranged in-house. Tuk-tuks at the gate, staff will advise reasonable transport rates but may need to bargain anyway. About 10 mins to the market area.","title":"Sunset and surf"},{"date":"2018-07-19T00:00:00.000Z","text":"This is a lovely hotel with stunning views and great food. A few small items made our stay a tad less than spectacular, but overall, it was still very good. First, our bathroom shared a pocket door (that could not open) with one of the lounge areas on the 2nd floor. It was kinda odd using the restroom and hearing talking, laughing, etc. just a few feet away. Second, we had bugs in our room on two occasions during our week long stay. Nothing came home with us, which was my main concern, but still, kinda odd. Third, management \"accidentally\" included a welcome letter (with our name on it) in our packet inviting us to the Long Room for complementary cocktails each evening. The one time we went, we were rather rudely told we were not entitled to be there and would be charged for our wine. We said no problem. We took our letter (addressed to us) to the front desk just to clarify what we should expect over the next few days and were told it was a mistake - sorry. That being said, I would've expected more from a hotel of this type. They made the error, but we were basically brushed off. Not a really big deal since we're not huge drinkers, but it wasn't the best customer service experience. On the other hand, the food at every location was awesome. The laundry service is fantastic. The concierge service is over the top. The spa was absolutely fantastic. The view from our room was stunning. I'd stay again (in a different room).","title":"Pretty much awesome"},{"date":"2018-07-15T00:00:00.000Z","text":"We booked the Galle Face hotel for the last night of our trip to Sri Lanka. We splashed out on a junior suite to make our last night special.We were in fact upgraded to a bigger suite which was very nice. The hotel decor is delightful with lovely sea views. But...... the service was a let down.My husband and I were sharing the suite with our teenage son and requested an extra bed at time of booking. When we arrived we asked for the extra bed to be put in the room. It didn’t arrive, so on our way out for a spot of shopping we asked again and were assured it would be delivered to the room whilst we were out. When we returned ..... still no bed.We rang reception and asked for the third time, to be told it would be done whilst we were at dinner. On return from dinner, still no bed! In fact it took my husband going down to reception at 9.30pm and asking for the 5th time, as we wanted to get to bed early for our flight the next morning.I have to say that the service we received throughout our trip was excellent. This was the one exception and a disappointing end to a lovely trip.","title":"Such a shame."},{"date":"2018-07-14T00:00:00.000Z","text":"We had a great week here while attending our special jw.org convention, visiting from the US. The staff, food, view, spa, cleanliness, and service all made this a 5 star experience. Great attention to detail by the friendly staff.","title":"Exquisite"},{"date":"2018-07-14T00:00:00.000Z","text":"Galle Face Hotel is a beautiful colonial hotel. Staff were friendly and helpful and the location for breakfast was divine. Pool setting cocktails at sunset were fabulous and interconnecting rooms great for the family.","title":"Great start to holiday"},{"date":"2018-07-12T00:00:00.000Z","text":"Our family stayed here two nights at the start of our holiday. It was a refuge in a busy city. Staff were great, rooms fabulous, breakfast delicious. Pool side bar great, pool clean and a good size. Highly recommend as a luxurious treat.","title":"A perfect way to start the Sri Lankan adventure"},{"date":"2018-07-11T00:00:00.000Z","text":"We have just spent a week at this Hotel. The Staff provided every help and assistance. The location is excellent to benefit from the sea-view and also proximity to the town centre. The Verandah Restaurant provided an excellent Buffet for Breakfast, Lunch and Dinner.","title":"A stay at Galle Face Hotel will be remembered for life"},{"date":"2018-07-10T00:00:00.000Z","text":"We booked for three nights into this well known hotel at the start of a fortnight of travelling around Sri Lanka. However our expectations were soon dashed. All five people in our party came down with symptoms of food poisoning although none of us ate anywhere outside the hotel. One of our party ended up in hospital where she was diagnosed with Campylobacter. The remaining four of us were less badly affected but the incident ruined the start of our holiday. We were disappointed that the hotel not only took no responsibility, but showed no concern and offered no apology. Their attitude was arrogant and uncaring. Despite being highly experienced travellers we were all left shocked and dismayed and under no circumstances would recommend anyone to stay here. I’m glad to say this bad experience was not repeated anywhere else in Sri Lanka but made a very unfortunate impression. The management of this hotel needs to try harder in every sense.","title":"A Hotel to Avoid"},{"date":"2018-07-09T00:00:00.000Z","text":"If you enjoy some old style charm, similar to Raffles, Singapore stay here. We had a seaview room which was very large. The bed and bedding was very comfortable. The giant spa bath in the middle of the room novel, and the after 5's canapes excellent. Breakfast was delicious and the service flawless. Staying right next to Galle Face Green was a bonus, and a late afternoon walk down the promenade is certainly an experience worth having.","title":"Stay at this hotel"},{"date":"2018-07-09T00:00:00.000Z","text":"Nice place to stay over night.se view hotel and send faced bar is place to have a coffee in the evening.r oom was very clean and the staff was very helpful for us.and easy to booking and contact the hotel as well.","title":"Nice place"},{"date":"2018-07-09T00:00:00.000Z","text":"Had 2 nights here to acclimatise before setting of on tour. It’s a great spot to relax if you need to get over a long flight or arrive late at night, also a good base for exploring Colombo.The rooms are a bit dated but large andeverything works fine. The real highlights are the excellent service from all staff, happy hour drinks on the terrace of the Travellers bar and the superb breakfast served on the veranda overlooking the ocean. There’s also a small museum worth checking out as befits a place with an interesting history and many notable former guests.You can’t swim in the sea here (I’m not sure you can anywhere in Colombo as it seems quite polluted) but there’s a nice saltwater pool which I actually found a nice change from the usual heavily chlorinated hotel pools. There’s also a gym which is small but ok for a holiday workout.Didn’t have dinner at the hotel as we went to the Ministry of Crab (which is a 5 minute tuktuk or car ride away) but the evening buffet on the lawn looked very popular.Overall the place has real charm and would stay again if returning to Colombo","title":"Old colonial charm and great service"},{"date":"2018-07-04T00:00:00.000Z","text":"Stayed for 6 days. Its heaven. What a place. Great food, amenities, service. Me and my wife really liked this place.One thing I want to recommend. It was my official tour. I took my wife with me but hotel charged for her breakfast. I was in Manila last year but in similar situation Hotel Sedan didnt charge anything for breakfast and I still remember their good gesture.SHAZIB SAEED","title":"Excellent stay"},{"date":"2018-07-03T00:00:00.000Z","text":"Two nights in Colombo staying at the Galle Face. A lovely old style hotel on the waterfront. A Colombo institution. Rooms were large and well equipped, staff friendly and attentive, would certainly recommend it. Ate in the beach bar one night and had drinks there the second. Food was good and reasonably priced for where you are, other restaurants in hotel we’re a bit more pricey and smarter but still good value. The pool was lovely and overall hotel facilities were first rate, remember this is an old colonial hotel and it feels like it.Colombo itself is a mad “Indian”city with all the contrasts and challenges you would expect in this part of the world, the Dutch hospital is a wee oasis in the storm, lovely for a coffee and a sit down before hitting galleface green or slave island areas. Usual bunch of hangers on, just don’t engage with them.","title":"Old style grandeur"},{"date":"2018-07-03T00:00:00.000Z","text":"This hotel has stunning grounds. Pool and restaurants face the ocean which makes for beautiful sunset and breakfast views. Staff at the restaurant for dinner her helpful and friendly and the breakfast buffet had some delicious choices. A downside would be a location, as there is not much around, for example, I had to walk for around 10 minutes to find a working ATM. However, I’m not sure anywhere in Colombo would have an ideal location and they do have Tuk Tuks waiting outside. As for the rooms, the bathroom is beautiful and spacious but the actual room is slightly on the smaller side. Overall, a comfortable and pleasant stay.","title":"Beautiful grounds"},{"date":"2018-06-29T00:00:00.000Z","text":"Words almost don't do this place justice. It's a total throwback, from the architecture to the ambiance to the accommodation. Hotel staff is just itching to satisfy -- no request is too audacious and the many employees working the grounds seemed to take pride in their work and the satisfaction of the guests.The room was spectacular. It was large and airy with a small balcony that overlooked the Indian Ocean. A large hot tub sat almost in the middle of the room, separating the entry area from the bath\/shower area. Lots of fine stone and marble. The bed was fit for a Sinhalese monarch. The shower was fully enclosed and steamed up like a closed pot full of broccoli.The hotel itself was like a living museum. I could spend a day or so just wandering its halls and exploring the grounds.This place was one of several my wife and I stayed at during our honeymoon in Sri Lanka, and it ranked among the highlights of the trip.","title":"Old-fashion grandeur, splendor at every turn"},{"date":"2018-06-29T00:00:00.000Z","text":"We loved Galle Face, an amazing old hotel with a rich history and beautiful rooms. The Traveller’s Bar makes great cocktails and the view of the ocean from the bar is stunning. Brilliantly helpful staff and very centrally located, though not noisy in the rooms at all. The only negative would be that the breakfast is a little pricey, but if you wanted to fill up on the entire buffet then you could definitely get your money’s worth!Situated right by the main beach, you can walk out the front door and start experiencing the hustle and bustle of Colombo right away.","title":"Beautiful hotel in the city"},{"date":"2018-06-28T00:00:00.000Z","text":"Our 4th stay at this iconic hotel as a family of 4 adults occupying 2 junior suites impressively and attentively serviced by “Keeth,” for whom nothing was too much trouble.The selection and quality of the Sri Lankan cuisine has delighted us on every visit and even more so on this occasion. The local cuisine is admirably complemented by a rotation of other international cuisines. Once again, the service of staff throughout the hotel, from doormen through to porters and wait staff in the dining room, at the pool bar and the verandah bar, has been charming and attentive.Definitely a place to return to, to restore and revive through its exemplary hospitality.","title":"Relaxed gentility and superb service."},{"date":"2018-06-27T00:00:00.000Z","text":"This was the best decision too stay for a few days & be introduced to the delights of Sri Lanka. This hotel carries so much history, it is the oldest hotel in Sri Lanka, has its own museum and gallery of photos of notable people who have visited over the yearsl, I highly recommend you treat yourself & stay here if you can or at least visit the museum and stay for high tea.","title":"Old World Charm"},{"date":"2018-06-26T00:00:00.000Z","text":"We family of 4 stayed in Junior Suites at Galle Face Hotel. It still has the colonial welcoming of its guest. Heights of our stay was watching lowering of the national flag at sunset with a Scottish piper tune.","title":"Family Beak in Colombo"}]