[{"date":"2018-07-19T00:00:00.000Z","text":"Me & my husband visit your place last night. We are specially grateful by the way we are treated by Dileepa Nayanajith. It was excellent. Since we got here not only he did his job well but also he did it as thinking it's his own duty & his own place. Such a good mood that we frequently got from him in friendly manner at the same time being able to keep a professional attitude . Good luck..","title":"Special thanks..."},{"date":"2018-07-19T00:00:00.000Z","text":"Dinner at graze kitchen ...it amazing .The variety of foods and quality service provided by staff was very impressive .I loved my experience there.When i really come again ....definitely i will come back .thank you to Dileepa Nayanajith for your personalized customer service.I enjoyed it very much...","title":"AMAZING"},{"date":"2018-07-19T00:00:00.000Z","text":"From the time we entered this hotel we were treated with warmth and made to feel at home .lovely staff and they are very friendly.special thanks goes to dileepa nayanajith .who waited our table attending to our needs all time.he very good care of us and treated us very well foods are very tasty.Excellent .","title":"Gorgeous hotel ,they make us feel at home"},{"date":"2018-07-18T00:00:00.000Z","text":"specially thanks to Dileepa Nayanajith.. for your fast & friendly server.. cheerz !! much love","title":"Excellent service ! Tasty foods !"},{"date":"2018-07-17T00:00:00.000Z","text":"Myself and my partner had the dinner buffet 2 out of 3 nights whilst in Colombo and we thoroughly enjoyed it!The food selection is brilliant and every single dish is presented with such care and attention. There really is something for everyone.The first evening, we were served by the most genuine and polite young man named Davinda. His service was impeccable and his English was the most articulate that we had heard spoken in Sri Lanka. He was so quick to take our order, clear plates etc. The most impressive thing was that when we returned for our second visit, Davinda spotted us from accross the restaurant and made a special effort to come back and talk to us about our time in Sri Lanka. Davinda is an absolute credit to Hilton Hotel and I’m sure he will do well in his hospitality career, he really was such a lovely young man.","title":"Absolutely brilliant - service fantastic"},{"date":"2018-07-16T00:00:00.000Z","text":"Buffet food in hotels can often be very depressing, noisy and lacking in style. Graze Kitchen is quite the opposite - very elegant surroundings and attentive waiting staff and most importantly beautiful food. A huge range of cuisines, but all delicious. I particularly appreciated the mini deserts - I could have several and not feel over full! Raspberry parfait was lovely. Perfect place to end our Sri Lankan trip before going to the airport for the late flight back to Melbourne.","title":"Great Buffet"},{"date":"2018-07-16T00:00:00.000Z","text":"We went to Graze Kitchen to celebrate my sister’s birthday. The food was good. The atmosphere was wonderful. They surprised my sister with a calypso band that sang her happy birthday and a cake. Most of all our waiter, Asanka, was extremely nice and always there for our needs.","title":"Great service!"},{"date":"2018-07-16T00:00:00.000Z","text":"Amazing food and great service. Staff was really nice and helpfully specially dileepa who attended to our needs.","title":"Good food and great service"},{"date":"2018-07-15T00:00:00.000Z","text":"Extremely tasty food with loads of choice. The vegetarian Indian food in particular was delicious. The staff were extremely helpful and welcoming as we weren’t staying in the hotel but came in just for food. Only loses one star as the buffet was expensive compared to other places in Sri Lanka but we were happy to blow the budget on the last night.","title":"Great buffet"},{"date":"2018-07-14T00:00:00.000Z","text":"Great service great food Specially thanks for janitha.. He gave us a fabulous service. Superb”creme brule” for Desert ..","title":"Family dinner out👌"},{"date":"2018-07-13T00:00:00.000Z","text":"We went there for dinner to celebrate my husband's birthday. After going in late too I still asked them if they could surprise my husband with a cake. They were more than happy to oblige and after dinner they brought in the cake along with the band and all staff sang and made the moment extra special. I cannot thank you enough. Special shout out to Sudaraka and Dileepa they did a great job. Food was amazing and they had a variety to suit each palate.","title":"Awesome"},{"date":"2018-07-13T00:00:00.000Z","text":"Gave my friends a high tea treat as a birthday treat and it was amazing . Everybody enjoyed. Great service and very customer friendly. One of the best experiences I’ve had. ♥️","title":"Amazing service"},{"date":"2018-07-12T00:00:00.000Z","text":"Booked this place for Sunday Lunch for 13 people on 8th July 2018 . The reservation desk was nice enough to arrange a private dinning room which was nice as it gave us more privacy. Although it was a slight distance to the buffet table it was well worth it. We also had the pleasure of having Roshini Weerawickrema attending to all our requests at the table. She was very courteous and pleasant.The food too was great in terms of taste and variety was sufficient. The lamb carving station was a put off, while the sushi station could have improved on variety. The Chinese section was great. I was however unable to try out the Indian section as I had quite lot. The desserts section was good as there was a make your own ice cream counter is a must have for kids. I also liked the small individual portions of the puddings so you dont end up throwing half of it. The cakes sadly were little dry, the watalapam also could have been much better. Overall good presentation and ambiance.","title":"Lunch with a crowd of 13 on 8th July"},{"date":"2018-07-12T00:00:00.000Z","text":"Had the dinner buffet with my wife and two teenage daughters. There was a really nice variety of food to select from on the buffet. I really liked all the sushi, the Sashimi was excellent. The sushi chef is the same from Ikoi Tei. Also the shrimp cocktail and chilled crab was really nice. They had really nice lamb shwarma as well. I also tried some grilled squid which was great. I'm not a fan of Indian food but if you are, there are a lot of Indian options. The dessert selection was also excellent. In addition, the staff is really friendly and helpful. We had great service from Dileepa and Sudaraka. We will go back again.","title":"Great variety on the buffet"},{"date":"2018-07-11T00:00:00.000Z","text":"Yesterday night we ara going to graze kitchen.it is amazing place.the food was really good i love it so much .anyway dileepa is very kindly person he was very helpful for us.actually we like to come again that restaurant.","title":"It's gorgeous dinnerout"},{"date":"2018-07-11T00:00:00.000Z","text":"Wonderful n delicious foods. Also friendly service. Specifically Dileep. His service is very good to be appreciated. Had a great service from him which makes me want to come again.This type of employees are an asset to a hotel.Hope to come again.","title":"Fantastic Foods n Affable service"},{"date":"2018-07-10T00:00:00.000Z","text":"The food was exceptional in both quality and variety. Also, the service was outstanding. Many thanks to Zoysa who took it upon himself to personally look out for us during our 10 day stay at the Hilton. I would definitely come again.","title":"Exceptional service"},{"date":"2018-07-10T00:00:00.000Z","text":"Our organization had a special convention here from July 6th-8th. The whole staff was very attentive to our. There were over 200 of us and I am sure everyone feels the same way. Thanks to the staff and the management for their hard work. It made our first trip to Sri Lanka enjoyable.","title":"Large Convention"},{"date":"2018-07-10T00:00:00.000Z","text":"The Graze Kitchen has an amazing variety of food for the breakfast buffet. It is definitely the largest one I have ever seen. The environment is lovely, especially by the pond, and the food was all delicious. Shan provided wonderful service for us and nothing was too much trouble for him. Highly recommend.","title":"Fantastic variety of food and fabulous service"},{"date":"2018-07-10T00:00:00.000Z","text":"Amazing food! Such a great variety of food. Vronsky was extremely friendly and looked after us very well! Will definitely be back!","title":"Great food, even better service!"}]