[{"date":"2018-07-21T00:00:00.000Z","text":"We booked triple rooms got doubles and they say can't help their out of rooms ??? We came all the way from nuwara eliya to here this after pre booking rooms two weeks before ??? At room 61'... still out ..no rooms . Shik","title":"Worst place ever"},{"date":"2018-05-28T00:00:00.000Z","text":"We checked in while sitting on the terrace sipping orange and mango juice and admiring the Sigiriya rock behind the swimming pool. A nice uniformed English-speaking lady brought the key to room 22 and accompanied us to the room. A moment later, a man brought our bags.The room was clean and large enough for us. The wi-fi signal was good. We had no neighbor noise but we could hear conversations while in the bathroom which must have been connected through the vent system.We went to the terrace and ordered pineapple juice. After the drinks arrived, a monkey dashed down from the roof and stole the pineapple wedge on the rim of my glass. Later, I saw the chicken wire surrounding the main restaurant and I assume it is to keep the monkeys from carting off whole dinners.The buffet dinner was held in the large restaurant with two musicians playing local music. The buffet was ok but not great. I liked the ice cream in the dessert area.The buffet breakfast in the big restaurant was very good. I especially liked their chocolate croissants.The hotel provided complimentary room and board for our driver.Check out was easy and pleasant. An excellent value considering the location.","title":"An excellent value in Sigiriya"},{"date":"2018-07-19T00:00:00.000Z","text":"Great location for climbing Sigiriya Rock and seeing wildlife (they regularly have wild elephants very close by).Restaurant is a little basic in presentation, but food was really good.Rooms are basic and simple (3* standard), but okay for a couple of days whilst on tour.The pool has great views, but be careful with children as surprising deep at one end!By the way, its well worth climbing the rock. But do it early in the day before the heat sets in and allow a couple of hours. The views are worth it.","title":"Great location, ideal for Sigiriya Rock and wildlife."},{"date":"2018-07-14T00:00:00.000Z","text":"Great hotel, fine rooms, lovely pool with excellent view to Lion Rock. Great food, great service. Good cocktails. Breakfast is of high class with both Sri Lankan, Asian and continental dishes. Recommended.","title":"Great hotel"},{"date":"2018-07-13T00:00:00.000Z","text":"We were very impressed with the service as soon as we arrived, receiving a warm welcome with some drinks to relax with after our long drive.Our room was spacious and bright and the pool area with the view overlooking Sigiriya rock exceeded our expectations. We loved all the Sri Lankan food in the breakfast buffet (they also have a wide western selection if you prefer) and the freshly cooked omelets.Because we stayed four nights we even received a surprise invitation to have some free cocktails and canapés one evening which we thought was a lovely touch.I would definitely recommend hotel Sigiriya and will hopefully be back again!","title":"Had an amazing time!"},{"date":"2018-07-13T00:00:00.000Z","text":"4 stars for Sri Lanka standards :)We stayed our first two nights in Sri Lanka at this hotel. Nice spacious rooms, great view to the Rock, large clean pool, good massage offers, and large buffet with both local curry dishes and international choices for the kids. Cozy bar and lounge area - and service minded staff.A great start of a vacation!","title":"Great Sigiriya Rock View resort"},{"date":"2018-07-10T00:00:00.000Z","text":"We booked this hotel for one night only to allow for an early morning climb of the rock. We were extremely happy with our choice. Location, rooms, breakfast and staff were excellent. The layout of the hotel is like a resort so that was a nice surprise.","title":"Perfect lication"},{"date":"2018-07-09T00:00:00.000Z","text":"We stayed four nights here while on a private Sri Lankan tour. It was a wonderful oasis to return to after hot days in the sun sightseeing. An excellent location for visiting Lion Rock, the cultural triangle and Minneriya national park.Recently painted rooms.Lots of breakfast buffet options. Dinner was buffet or a-la-carte with plenty of western or Sri Lankan options.Excellent laundry service too.","title":"Peaceful retreat"},{"date":"2018-07-04T00:00:00.000Z","text":"Nice hotel , with good view and friendly staff,the food was delicious room was spacious,would recommend if you like the nature. Only negative thing I can thing of is, there is no kids pool! Stayed for one night in June!","title":"Excellent"},{"date":"2018-07-02T00:00:00.000Z","text":"We absolutely loved this hotel. The staff were wonderful, accommodating and very sweet. The food was delicious with lots of variety (including a lot of vegetarian options) and the mango smoothies were amazing! I would definitely recommend this hotel.","title":"A hidden gem"},{"date":"2018-07-02T00:00:00.000Z","text":"This hotel is a gem. Staff are friendly and relaxed (no one tried to sell me a tour!) Housekeeping always say good morning when they pass and the restaurant staff (particularly Kamal) greeted us with a smile. Pool staff were great too - daughter got an insect bite and there was help on hand.Breakfast was tasty too; I will miss the egg hoppas.Location is good as well. Easy access to the cultural triangle and close to the village for meals.Grounds are pretty too and there is always that view from the pool :-)","title":"Beautiful Hotel Sigiriya"},{"date":"2018-06-30T00:00:00.000Z","text":"This hotel has nice and comfortable rooms near the old fortress. Their pools are nice, swimming a bit at night or after walking up the fortress felt very good. The food, however, was not particularly good and their drinks service during dinner is slow.","title":"Nice hotel very close to the old fortress"},{"date":"2018-06-25T00:00:00.000Z","text":"this hotel is by the far the best one i have stayed in ages. it far exceeded my expectations in everything. amazing food, service, spa treatments, location. great view of the rock from the swimming pool. u can also see the hotel from the top of the rock. we loved the ambiance of sigiriya. hotel is a bit dated but still clean and very good. swimming pools are great. amazing stay","title":"the best!!!"},{"date":"2018-06-18T00:00:00.000Z","text":"My husband and I were on our honeymoon tour and we stood at The Hotel SIGIRIYA on 30th of April and we were warmly welcome by the hotel. The location view amd the interior of the hotel is mesmerizing. Meal was delicious and room service was excellent. We mist special thank to Mr. Pasan rakhitha ekanayaka for his great help. He helped us alot and treated us well. We thank you all for your great service and looking forward to be there once its possible.Supeshala & bhashitha.","title":"One of the best hotels we have ever stayed"},{"date":"2018-06-18T00:00:00.000Z","text":"Stay two days in Sigiriya. This is a wonderful hotel with great view of the Lion Rock. The staffs are very nice and willing to chat with visitors. The hotel also provides efficient laundry service.The restaurant offers nice morning buffet and the dinner has various options e.g.: dishes, buffets and catch of the day.And also, I really love the hotel has a space to introduce different spices of animals in Sri Lanka.","title":"Leo Cheung"},{"date":"2018-06-12T00:00:00.000Z","text":"Fantastic Hotel with wonderful facilities and excellent food. The number one place to stay when visiting the rock. Rooms clean with staff very attentive and nothing was found to be too much trouble and with the most wonderful view in the evenings an added bonus.","title":"Hotel Sigiriya"},{"date":"2018-06-09T00:00:00.000Z","text":"We stayed at this hotel for the sole purpose of climbing the nearby historic Sigiriya Rock Fortress. The hotel was however a delight in itself with lovely large rooms, recently painted, a pool area which had a clear view of the fortress, a wonderful restaurant and relaxing bar area. A short walk away was a small area of tourist shops and a cafe. I would love to have spent another day just relaxing in the hotel grounds and walking to the nearby village shops.","title":"Wished we had stayed longer"},{"date":"2018-06-08T00:00:00.000Z","text":"Everything was great about this hotel. It was situated in an impressive acreage with birds and monkeys all around. The elephants roamed nearby, so that we saw several groups on the road at dusk as we returned to the hotel. The breakfast and dinner buffets at the restaurant were absolutely superb. Just wished that we had had more time to enjoy all that the resort offered.","title":"Lovely resort with great views of Sigiriya rock from the pool."},{"date":"2018-05-31T00:00:00.000Z","text":"It is a very nice hotel situated in Sigiriya jungle with a nice view of the Sigiriya rock. Very close to Sigiriya rock(1.3Kms)We booked two deluxe rooms. The rooms are all clean including the toilets. Rooms size is not that much big. But oky :) We are given in-room tea\/coffee making facilities, shower gel, shampoo towels. With A\/C, television and a mini bar. But no mosquito vaporisers. I believe that is highly important for a room in Sigiriya.Food, we booked from the menu (a la carte) as well we used the buffet. Menu contains mostly burgers, pasta, sandwiches and all. But for buffet you are getting international and Sri Lankan food too. They have a juice and alcohol bar. I believe that is quite expensive but they allow outside liquor with a corkage charge.The people and the service is awesome. People are very friendly and helpful. They welcome us with a nice welcome drink. I really appreciate that.Overall, I love the hotel which maintains the natural beauty as it is and hope the hotel management will get an action on mosquito problem in the room :)","title":"Eco-friendly hotel in Sigiriya"},{"date":"2018-05-31T00:00:00.000Z","text":"We spent one night here at Hotel Sigiriya and we had a great time. We booked two twin rooms with bed and breakfast option for a reasonable price (LKR 26,000).This hotel got the best view to the Sigiriya rock. In both rooms ,there were some space below the doors, so that helps bugs to come in to our rooms. That will be great if they can cover those spaces.They got limited options in their dinner menu, we got more western food selection. It will be great if they can add more local and Asian food choices in to the list. But the breakfast was so good and it got lot of variety.However , I can recommend this place to anyone who wants to spend a night or two around sigiriya.","title":"Amazing view !!!"}]