[{"date":"2018-07-06T00:00:00.000Z","text":"I visited for dinner with my family. The friendly and courteous service makes me attracted to this restaurant. Actually, the prices are quite ok, but the service is a little late. The space to dine is also fine. Tell your expectation and all will be fine!","title":"About Jak Tree"},{"date":"2018-07-02T00:00:00.000Z","text":"It is indeed a nice place for mouth watering food. We had cuttle balls which i guess is most crispiest in town. We ordered Thai rice with Chinese dishes which was awesome. Mostly a portion is very large even we took the remaining. The service was good, courteous and friendly and I have no doubts to recommend this restaurant for any person who wishes to enjoy some good food.","title":"Great tasty food"},{"date":"2018-06-30T00:00:00.000Z","text":"Visited for dinner with family after more than a year. Friendly and courteous service. You need to speak to them nicely. Tell your expectation and all will be fine! It's not the usual way to go about it but if you expect excellent yummy tasting food then tell 'um so....it always works...even with the 5,6 or 7 star hotels and restaurants...The green curry chicken, red curry prawn, mango salad, Sea food Tom yum soup, sea food fried rice(less oily of am being too picky), tamarind mixed vegtable dishes were all super tasty and exceeded our expectations. It was very close to the best (Royal Thai and The Boulevard). Perhaps tastier in some way! Will return for sure. The staffwere upfront about the offers when it came to settling the bill. All in all will return for sure for a yummy Thai food meal!","title":"Excellent and Authentic Taste!"},{"date":"2018-06-29T00:00:00.000Z","text":"Though they claim to serve Thai and Chinese cuisine what you end up with is an insult to both types of cuisine. Simply appalling food.","title":"Appalling Food"},{"date":"2018-05-29T00:00:00.000Z","text":"Very bad service!!! A party of 13 was served by only one waiter. Curries came before rice ( we had to ask for rice to be served). The one drink that was asked for took a very long time to come. When we all asked for spoons, it never came. We had to look for a waiter to get water. Never go in a large group they can’t handle it.","title":"Bad service!!!"},{"date":"2018-05-27T00:00:00.000Z","text":"We went as a relatively large group (10 adults) on a Sunday for lunch. The restaurant was mostly empty, yet it took them almost an hour to get in our ordered food. We were placed in one of their private dining rooms, maybe because of that, they kept forgetting to check on our order. It took quite a while to get in the drinks and appetizers too. Food is good. But portion sizes are only adequate. Half of the items from menu was not available too. Overall, feel hesitant to recommend to others.","title":"Takes forever for your food to come in!!"},{"date":"2018-05-24T00:00:00.000Z","text":"Went for a quick dinner with my friend, but had a question about extra charges on the bill. The manager introduced himself and before we could even explain why we were questioning it, he became extremely defensive and aggressive in his tone. He then began to shout over everything we said (there was no one else in the restaurant), and wouldn't listen to why we wanted to talk in the first place. He started to mock us saying that we were 'foreigners trying to scam him' when in reality, we were questioning the extra charges on the bill which were NOT stated on the menu. Even when we asked him to stop shouting and listen to what we were saying, he just chuckled and said that if we really have a problem he can just call the police- a huge overreaction to us saying that we were unhappy about the charges that were not disclosed! He then told us to 'go to twitter and tweet about the restaurant' if we really dissatisfied, which was very insulting. He was extremely condescending when talking to us (two young female travellers) and dismissed everything that we had to say. Before we even paid he stated that it was 'time to break [his] fast' and left the dispute to go and eat- very unprofessional!!!!","title":"Worst service I have ever received"},{"date":"2018-05-24T00:00:00.000Z","text":"When it came to pay for our mediocre food, our bill had a 25% government tax and a 10% service charge. (But on the menu it only stated 10% for both would be added...)When we went to enquire about these charges (not even dispute as this point) - the manager was incredibly rude and shouted in our faces, interrupting us and not letting us talk. He was condescending and rude, not understanding how unfair it is to travellers on a budget to hide costs! (If we had known it would have been this expensive and out of our budget, we would not have eaten here).It was a very unpleasant experience, and it felt horrible to be shouted at. It should be made CLEAR that anyone dining here will be charged a significant extra amount for government tax. Most importantly, you should NEVER shout at two young, female travellers if you are a manager of a restaurant - it was a very scary experience for us and left us feeling vulnerable and a little shaken.","title":"WORST EXPERIENCE IN SRI LANKA"},{"date":"2018-03-30T00:00:00.000Z","text":"We visited this place a few months ago for a family dinner. Although reservations were made, believe it or not, the food took more that an hour to come to the table. 'Nuff said ...","title":"Good food, horrible service ..."},{"date":"2017-12-07T00:00:00.000Z","text":"Average Thai restaurant in Colombo. Food is horrible and what you expect is not there..For their curry's they don't use real coconut milk!It's not value for money at all . prices also compare it's not worth at all.Don't ever try this restaurant if you looking for real Thai food.Order take longer than you think and the staff is so lazy on there work& service.N","title":"Average food!"},{"date":"2017-12-05T00:00:00.000Z","text":"I visited this resrestaurant twice and on both occasion we've had a good time. Although there aremixed reviews to my knowledge thai foods they serve are tasty compared to other restaurants. Of course the prices are a bit on the high side and some of the portions are too small for the high price (eg - chicken with cashew). Overall its a decent place to enjoy good thai food although they have chinese cuisines as well. Staff is friendly and flexible too.","title":"Hector"},{"date":"2017-11-28T00:00:00.000Z","text":"the menu is a mix of chinese and thai food but overall a bit confused. I suppose there is some bias from my side as I eat chinese food in Singapore and thai food in bangkok on a regular basis. I don't know if the food has been localized to suit Sri Lankan people's tastes but in my opinion it's average.","title":"A place if you really crave for chinese\/thai food."},{"date":"2017-11-16T00:00:00.000Z","text":"food was not bad..nothing much like earlier.staff was friendly.can do better way to serve fresh food,not frozen.","title":"Not bad,overprice."},{"date":"2017-10-05T00:00:00.000Z","text":"My husband used to come here years ago, hence now that we returned to Sri Lanka, it was a must visit place. Biggest disappointment, the atmosphere was horrible, the beef was oversalted, the sweat and sour was oversweetened, the rest of the meal was the same bad quality. The food was excessively overpriced, the most expensive place we have been so far. For this price (or less!!!) you can go to the best fine dining restaurants and have a better experience.","title":"Horrible food, bad service - and too expensive"},{"date":"2017-08-15T00:00:00.000Z","text":"Once our favourite restaurant for take out, they were very accommodating and food was delicious. However, recently there has been a change of the kitchen staff and food was similar to amateur's cooking. There was no real flavour. It was a big let down!","title":"The worst Thai food experience!"},{"date":"2017-07-23T00:00:00.000Z","text":"The food is amazing as are the portions and the service. Most portions are shareable so order carefully. But the prices are a bit off and the food can be a tad oily. The staff were not so conversant on the menu to guide a newcomer.","title":"Expensive"},{"date":"2017-07-11T00:00:00.000Z","text":"The food is alright not too bad. We tried some of the Chinese and Thai dishes. The green curry and red curry was over powered by coconut milk. The Thai fried cuttle fish was nice. Not bad for a visit or two.","title":"Could have been better"},{"date":"2017-05-10T00:00:00.000Z","text":"We liked the beef curry (menu item90) it was really gravy. Mushroom (menu no30) really sucks. It hardly had mushroom but flour coated deep fried thing. Crab omelette also hardly had crabs (item 25)","title":"Great beef curry"},{"date":"2017-04-29T00:00:00.000Z","text":"Very good service, short time between placing order and appearance of food. The chicken soup was too spicy hot for our liking. The beef curry had too few pieces of meat. The mixed rice was tasty enough. Overall the food was over-priced esp. when 30.5% is added to it (service charge and taxes).","title":"Spicy food, a bit over-priced"},{"date":"2017-04-06T00:00:00.000Z","text":"I recently visited this restaurant  with few of my friends for a dinner. It was a nice place with adequate privacy. They have a friendly and helpful staff . They serve food without much of a delay. It was delicious and  bit spicy. They have a good variety of food for a reasonable price. Overall its a good place for couples , families and small group get togethers.","title":"Delicious, Friendly, Reasonable Price.."}]