[{"date":"2018-07-21T00:00:00.000Z","text":"Excellent hotel. We were part of a number of people staying in this hotel for one week for a conference in Colombo. Comfy and spacious rooms and bathrooms. Very helpful and attentive staff. Very good breakfast. Great roof top infinity pool, bar and resturant. Local supermarket located just across the road was very handy. We were going backpacking around Sri Lanka for one week after our stay and the staff stored our suitcases for free during this time which was very helpful. Would reccommend!","title":"Excellent Hotel. Would Happily Stay Again."},{"date":"2018-07-20T00:00:00.000Z","text":"We stayed here for a week and we loved the roof top pool and bar. The rooms were very clean and the staff was amazing - especially Dula! There is a grocery store right across the street which was very convenient also. We would not hesitate to stay again.","title":"Great place!"},{"date":"2018-07-18T00:00:00.000Z","text":"Stayed here for two nights when we landed in Sri Lanka. The staff are very friendly but have about as much knowledge about the area as John Snow from Game of Thrones. There is no information or brochures which you would expect from a place \"claiming\" to be 5*. It is not a 5 star hotel. Our room was nice but not great. The pool area is nice with a fantastic view but we left a bit disappointed and expected more.","title":"OKAY"},{"date":"2018-07-13T00:00:00.000Z","text":"Jetwings group is well known for their fantastic hotels and tours. Don't bother second guessing yourself if it's Jetwings, it's usually one of the very best. Colombo7 is conveniently located in the heart of everything you will want to see in town, everything is just a short drive away (be mindful of Colombo's notorious traffic jams). Despite the chaos outside, its blissful once to step into the hotel. The staff here are all about great hospitality, most welcoming and always ready to please. The rooms are super modern, spacious and very comfortable; good breakfast and fabulous roof top pool that stays open until 10pm. What more can you ask for?","title":"Great city hotel"},{"date":"2018-07-12T00:00:00.000Z","text":"Checked in for one night before tour of Sri Lanka and had additional 2 nights here at the tours conclusion. On both occasions, check in was a little drawn out but the staff are very friendly and helpful. Both rooms we had were well appointed (we were upgraded to a studio room on our return stay which was great as has a washing machine) and very comfortable. The buffet breakfast was OK but can be very busy especially if there are large groups staying there. The rooftop bar and infinity pool provides a great view of Colombo although it is not very large and can get busy (see review of Ward 7 for food & drinks.) Overall a very nice hotel and we would consider staying here again.","title":"Well located and great service"},{"date":"2018-07-12T00:00:00.000Z","text":"My wife and I and our friends could not have been more pleased with our stay at Jetwing Seven. We stayed in the hotel for a full week attending a Special Convention in Colombo and touring different parts of the city and countryside. The Hotel is clean, comfortable, and very affordable. The staff treated us like family and made sure that we had everything that we needed. I would say the highlights of the Hotel are the rooftop bar and restaurant Ward 7, which has delicious food and refreshing drinks. Be sure to try the Ward 7 cocktail or the Anesthesia. Along with the restaurant the infinity pool at the top was a relaxing way to end the day and cool off, plus the views of the city are simply breathtaking. The breakfast buffet is also very good, the servers bring you your choice of coffee, cappuccino, espresso, our Sri Lankan tea. As for the food you can eat breakfast like a local or visit the omelette, waffle, pancake station and have the staff cook to your taste.The cleaning staff is also wonderful, one day my wife left her scarf on the bed, and they had folded into a flower! Little touches like that make a great hotel even better. If you are contemplating staying here my final recommendation is to book it and enjoy your stay. You won’t regret it!","title":"Amazing Hotel in the Heart of the City!"},{"date":"2018-07-06T00:00:00.000Z","text":"We stayed for 10 days on off while using other Great Jetwing properties. The Colombo 7 is a Great City Hotel.with all Modern amenities and the Breathtaking roof top pool.The staff is Great.Mainly the Front office staff and the Assistant Manager who looked us so well.A Big Thank you to the owners of Jetwing for Giving the opportunity to the client for a enjoyable stay.If anyone visits Sri Lanka pls stay with Jetwing Group and you will never be disappointed.","title":"Great"},{"date":"2018-07-04T00:00:00.000Z","text":"We spent three nights at the Colombo Seven prior to our tour of Sri Lanka. Due to the high occupancy of the hotel we were upgraded to a better room than booked. The room was very clean and comfortable. Staff, from check-in to check-out were all courteous, well presented and helpful. The roof-top bar and pool was a delight to behold and enjoy a relaxing drink. Without be crtical, I would recommed the hotel invested in a promotional tourist map of Colombo and attractions to assist guests enjoy their stay.","title":"Ideal Stop-over Hotel for Colombo City Stay."},{"date":"2018-06-22T00:00:00.000Z","text":"Jetwing is one of the best hotel chain in srilanka. This one is the best place to stay at the heart of colombo... (but not for relaxation)Friendly staff.... very helpfullVery good location...Best thing is the roof top infinity pool( though it is bit small)Foods are average...Room was very clean and comfortable...Bathroom also super clean...View from the room is dissapointing... its just buildings ...all over there ( but... what else to expect in colombo actually)","title":"One of the best place to stay at the heart of colombo"},{"date":"2018-06-12T00:00:00.000Z","text":"Nice place with nice people around managing it.Had a memorable and comfortable stay.The breakfast was delicious,the roof top infinity pool was breathtakingly beautiful and the rooms,fabulous.Would love to come back.....","title":"Chic,cherubic,cosy,comfortable,"},{"date":"2018-06-08T00:00:00.000Z","text":"I stayed there for 12 nights in late May, - thouroughly enjoyed my time there.A nice, very spacious room with ample space for clothes etc.A big, very modern bathroom with an excellent shower AND rain-shower.Very good breakfast, a nice variety of Western and Sri Lankan specialties.The dinner menu was (due to low season I presume) rather small, the quality of the food was excellent!A big infinity pool on the roof, a great bar besides it. What more do you want.The BEST feature of the hotel however the very pleasant staff! Beginning with the room boy on 7th floor all the way to the waiters, receptionists, the staff at the conference rooms and many others. Congratulations!","title":"Top in all Aspects"},{"date":"2018-06-05T00:00:00.000Z","text":"when i booked this hotel i was suprice becouse i never herd about this hotel i just booked becouse of jetwing how ever we had a great time hear i’ll never forget this day thank you all of the staff Ruvinda from front office and kumanga from room service ( don’t forget to change print mashing in room service)roof top bar and pool no words thank you again and again i’ll be back soon","title":"unforgettable day"},{"date":"2018-05-28T00:00:00.000Z","text":"This hotel is not remarkable in many ways. The pictures are what you get but it will not give a true wow feeling that some hotels, even if basic, do. At least not to spoiled travelers like us. The location is quite central and you are never more than 15 minutes underway.","title":"Modern hotel and good location"},{"date":"2018-05-27T00:00:00.000Z","text":"I can't speak more highly of the hotel and the service.The staff are exceptionally helpful. The reception takes a little long with tasks, but it's Sri Lanka everything is on Island time. The Sri Lankan breakfast is to be avoided, Bedding and internet and the upstair Bar is a treat. In spite of its little and forgivable chinks, it's the staff that holds the place together.","title":"Service on par with the Langham"},{"date":"2018-05-23T00:00:00.000Z","text":"I was there for a very short stay so didn’t get a chance to utilize the facilities, however it’s a new boutique hotel, quite small and cozy but absolutely lovely and clean. The rooms and bathrooms are aesthetically refreshing. Sleep quality was excellent. The lcd was new and even the toiletries smelt amazing!My favorite part of the hotel was the rooftop bar with an infinity pool. I took time out and went for a dip. Theouroufhly enjoyed my stay here as it’s also conveniently located in inland Colombo.","title":"Lovely boutique hotel"},{"date":"2018-05-15T00:00:00.000Z","text":"Good location in colombo as we were to spend only one night at the hotel...warm welcome by the reception staff but they did not have proper information about the package which was sorted out after few hours....The rooms are big with decent amenitiesWe were given two rooms and after few hours we noticed they both had termites on the furniture and eventually inside our bags....we had to change rooms late at night...bad experience...worst experience was during dinner when we were told to choose only from the set menu as there was no dinner buffet due to less occupancy...we had in prior informed the reception that we all were vegetarians and the staff assured us to provide more options but sadly that was not the case....after many complaints and arguments finally we were given options from ala carte menu....Never ever we had such experiences at any of hotels we stayed during our trip in Sri Lanka...Would not recommend this hotel for families or for travelers with long stays in ColomboRecommend to use other better options such as Taj","title":"Good hotel but badly needs improvement"},{"date":"2018-05-10T00:00:00.000Z","text":"Nicely done contemporary newly build hotel in the heart of Colombo making it easier to have any type of business gatherings or meetings. Nicely arranged meeting rooms with lot of improvements & helpful staff to support.","title":"Convenient business venue"},{"date":"2018-05-08T00:00:00.000Z","text":"We had a fantastic time at jetwing colombo 7 and will definitely return again. The staff are great and very helpful. Very Clean and the rooms are large and comfortable.The food isn't that great but everything else is Fantastic.","title":"Awesome hotel"},{"date":"2018-05-07T00:00:00.000Z","text":"nice hotel to stay in enjoyed upstairs bar and in finity pool about 33 kms from airport was start point for us for a tour nice buffet breakfast to start next day so was a good stop over. we would use again","title":"central"},{"date":"2018-05-05T00:00:00.000Z","text":"I spent recently several days at this new hotel. Friendly staff, conveniently located , spacious and quiet rooms. Hotel has no wedding hall facilities and is therefore quiet in the evening!Nice rooftop pool and bar for a relax and a snack. Will definitely come back !","title":"Pleasant surprise"}]