[{"date":"2017-08-10T00:00:00.000Z","text":"During my first visit to Colombo in middle of 2016, I was looking for Vegetarian restaurants and I trusted a Thai place to provide me veggie options. I wasn't wrong. I found a decent Thai restaurant with good veggie food.I ordered paratha, green curry and noodles. the dishes were good and quantity was also good. The aircon wasn't working that day or wasn't turned on that day because only 3 tables were occupied. Overall it was decent experience.","title":"Nice restaurant in Busy business distric"},{"date":"2016-09-20T00:00:00.000Z","text":"First time eat unpalatable Thai food. No body went to the restaurant. Staff are friendly and welcoming. Not recommended.","title":"Unpalatable"},{"date":"2016-08-05T00:00:00.000Z","text":"..am a guest of this place since many years and always appreciated the friendly and niceway of service.manager has changed there,now an unfriendly rude guy is overlooking the place and according his rude style also the staff has the same way to treat people.since manager and staff changed, i have been there twice:first time i have been very surprised about the boring mood of the staff,i have been the only guest at that evening.asking for the previous manager i was told he is on leave.as it turned later out,it was a false info to keep customers.the second time i also didnt find the previous manager,when i entered the place, a staff member ordered me to go to the upper floor of the restaurant.same time the current manager hurried to me and rose his hand up to tell me that the restaurant has a function and i have to leave immediately.its was actually in a very rude way to tell me that i have to leave. the behaviour of rising hand to a face of a guest doesnt belong in a restaurant or anywhere.it would have been professional to mention the closure for a function in the entrance areaon the down floor.for me,as a regular guest there,i will never come back to this place.the entire good mood of the place went with the earlier manager and earlier staff.if you dont want get into a frustrated evening mood dont go there!there are many other good options in colombo to have a peaceful thai lunch or dinner.","title":"rude staff,rude manager.."},{"date":"2016-04-29T00:00:00.000Z","text":"Place exactly opposite to the place where I stayed in Colombo, 2 days back I decided to give it a try and went their for dinner.Shockingly the IPL was telecasted with Hindi commentary at this place which gave me a comfort being at the Indian restaurant but it was weird that I was the only person eating their.Food was spicy and good, place was bit of a dark I think they might have switched it off as there was no customer.Staff were friendly and this place is good to dine when you want to be left alone.","title":"Thai food with sri lankan touch."},{"date":"2016-04-17T00:00:00.000Z","text":"The food was tasty. And there was a variety of food also. But the environment was not that attractive. Also the service was not that great. Time taken to serve after the order had been placed was too long.","title":"Food is Good, But the Service is not That Good"},{"date":"2016-01-01T00:00:00.000Z","text":"Having tried the Ministry of Crab (which was awful) we took a look in here. the place was empty but we took a chance and the food was absolutely lovely. So good in fact that we got a takeaway another day which was equally good.Very reasonable prices and totally recommended.","title":"Fabulous food"},{"date":"2015-09-01T00:00:00.000Z","text":"The problem with this place is it's dead like really dead. I think the reason is because it is situated behind the Dutch hospital and no one seem to go to the back of the complex and see around.Food is good and you can see the kitchen and the food being prepared. If you are in to a quiet moments it's a nice place to be but prefer the place to be crowded. The times we went there no one was there.Staff is good and value for your money. All in all a good place.","title":"Food is GOOD the place is DEAD"},{"date":"2015-06-27T00:00:00.000Z","text":"Great building, staff friendly enough, food was pretty standard fare (pretty good) then all three of us (one local, two British tourists, used to spice) spent a night and the next morning on the toilet with diarrhoea and vomiting.We could have just been unlucky so, if you fancy your chances, I'd recommend avoiding the prawns. Better still, go somewhere else.","title":"Seemed OK - spent the night in the toilet"},{"date":"2015-05-11T00:00:00.000Z","text":"Average ambience.. good food.. service was good too.Value for money if they have any credit card offers.. a must try .","title":"Good seafood"},{"date":"2015-05-10T00:00:00.000Z","text":"Average food, place is clean and well situated. Food serving takes a little time than other places.. People are friendly and informative...","title":"Average"},{"date":"2015-05-08T00:00:00.000Z","text":"The place in Dutch Hospital is good 'cause of the serene atmosphere and it's spaciousness.dine upstairs and you get quite a view too.the food it no 100% authentic Thai though.they serve hefty portions and the prices are very affordable.","title":"Good Thai food"},{"date":"2015-02-06T00:00:00.000Z","text":"Visited for lunch on a weekday. Given that we had to grab a quick lunch between work, we were a little anxious. However, the food arrived within 10-15 minutes which is great.The chicken green curry was delicious and the tom yum soup was bursting of flavour.Probably not 100% Thai cuisine but the restaurant delivers great tasting Thai food.The service and quick and the prices are very reasonable (Rs3,000\/- net for two including rice, two mains and soup)The portions are plentiful and we had enough food left to spare for another person.The restaurant is calm, quiet place although it's located at the heart of one of the busiest cities in Colombo. The interior is interesting and is made to provide a oriental feel, and they play Thai music which adds to the experience.The open space upstairs is ideal to host a cocktail party for a small crowd.Is definitely a more affordable Thai option in the town.","title":"Good food, great value!"},{"date":"2014-12-28T00:00:00.000Z","text":"The Thai restaurant Kinnaree is located in the heart of Colombo Fort (around Old Dutch Hospital). I am a lover of Thai food and wanted also to try this restaurant. The Tom Yam Shrimp soup was certainly one of the best I have ever eaten. The Thai cook knows how to make this authentic Thai soup. The main meal was also of good quality. The restaurant lacks a bit of cosy atmosphere but this is compensated by the very good food. Service is alright.","title":"Excellent Thai Food"},{"date":"2014-11-20T00:00:00.000Z","text":"Which, in Thai, means the food tastes good. And it did.Happy to see the Thai decoration is kept minimal and the (Thai) music played was at a discrete volume. And I like the frosty glasses the beer is served in.The attention of the waiters could be better but I can’t really complain. The manager is a nice person who is ready to advice and adjusts the servings so you can try more than a few dishes.The menu is not too comprehensive and covers all the standard dishes you would expect in a Thai restaurant.It is not the best Thai meal I have ever eaten, but all in all the food was good. None of the eleven (11) dishes put on the table disappointed.I would have preferred if the (Thai) chef had put more lime in the Tom Yang and in the Tom Ka Gai and he could also had put more chilli in some of the other dishes, but again it’s just me. Rest of the party seemed to be OK. I assume that the chef adjusts the heat down to “farang” level.One complaint though; when you serve Thai food there has to be, on the table, the 4 jars\/cups with sugar, fish sauce and dried chilli and green chilli in vinegar to adjust the food to your liking. Anyhow; as soon as I asked for it they also produced.I was happy to find the cost affordable considering the location. Bearing in mind the amount of food served and the number of drinks and beer consumed (they do serve beer in pitchers which resulted in a fairly high consumption) the cost came out around RS3,400 pax and that is a very reasonable cost in my opinion. And I did order too much food but when you want to try it all, what to do?","title":"Ahran aroy"},{"date":"2014-07-16T00:00:00.000Z","text":"Location is good in the rapidly developing Colombo Fort area just behind the Dutch Hospital complex. The restaurant is spacious and nice but not very Thai in terms of decor and ambiance. More like a modern city restaurant and the stairway leading upstairs might be a challenge for some people and a potential accident waiting to happen. The service is good as is the food but there is nothing outstanding. Felt the food was better at Siam House, which apparently owns this place. Tried a red curry and a Pad Thai, both decent but nothing to write home about. Worth a visit if you feel like Thai and are in the area. If not there are better options for Thai in Colombo.","title":"Missing something"},{"date":"2014-07-14T00:00:00.000Z","text":"A dull location. I selected this place to satiate my desire to have authentic Thai foods. I guess I achieved 75% of my expectations. I don’t know why they cannot make 100% Thai food, may be the ingredients are not available locally. Staffs were very polite and serving a wide variety of preparations","title":"Nice Thai food but a dull location"},{"date":"2014-06-29T00:00:00.000Z","text":"The food was actually good. It wasn't too much oily as the other restaurants. The inside was nice, but it was not so much thai looking atmosphere. They have a very friendly staff and so far their service is great.","title":"Calm atmosphere in a busy city"},{"date":"2014-06-26T00:00:00.000Z","text":"Was told that this place is also owned by Siam House's boss. However, I prefer Siam House' food more. Both places have friendly staffs.","title":"Siam House is better"},{"date":"2014-06-13T00:00:00.000Z","text":"Situated in the Dutch Hospital in Colombo, very nice ambience and food. We ordered some chicken wrapped in leaf along with some prawns and some red thai curry with rice. Overall the food was excellent.","title":"Nice Thai Food"},{"date":"2014-05-28T00:00:00.000Z","text":"The restaurant is situated right behind Dutch Hospital in a white colonial building. On the second floor waits a huge sitting area and plenty of tables so no need to book ahead. Kinnaree lacks the ambiance of a Thai place which partly could be explained by the interior which isn’t very typical Thailand.In regards of the menu it is quite big and contains items which you expect to find in a Thai joint but nothing more than that. You can get a Singha to wash down the spicey food with. As a main course I tried the whole fish (garupa) and it was quite a catch! A huge perfectly cooked fish with a simple non spicy lemon\/coriander sauce. Ingested with ease since the meat is simple to peal of from the bone.To summarize this place offers decent food but doesn’t live up to its full potential given its location. Worth a stop if you are in the neighborhood and hungering for Thai.","title":"Good food but lacks authentic Thai flavour"}]