[{"date":"2018-07-14T00:00:00.000Z","text":"I have been to nara thai earlier also but they had only ala’cart but now they have introduced a sunday lunch buffet this time. I got to know through face book. The buffet is really delicious with authentic thai food. There are so many choices of food.. really value for money for a entire meal. It’s just 2490 per person. We really enjoyed and my kids also enjoyed the meal they charge half price for kids. For sure we will come back again. Keep it up ✌️","title":"Delicious buffet with authentic thai food ❤️"},{"date":"2018-07-11T00:00:00.000Z","text":"Visited to narathai for sunday lunch buffet with my family.it's superb and simply the best thai buffet in Colombo. The ambiance was extra ordinary to matching the real thai concept. Service was fantastic. Value for money.definitely will recommend to all thai food lovers","title":"Super buffet"},{"date":"2018-07-09T00:00:00.000Z","text":"To whom it may concern, Great place with good food and good service aswell.. Would recommend to someone.","title":"Review"},{"date":"2018-07-04T00:00:00.000Z","text":"As a personal favorite I was really looking forward to trying out their platters and everything from their entrance ,the ambience to the assortment and presentation of their dishes was a truly unique experience. A real thriller on the tastebuds . Their Tom yum , Satay with peanut sauce,Pad Thai & Butterfly pea is a must try ! Looking forward to dining in again.","title":"An authentic Thai experience!"},{"date":"2018-07-01T00:00:00.000Z","text":"Finally a restaurant who's got it right when it comes to Thai cuisine . Great ambiance, super variety, great tasting and awesome service","title":"Super food, Great service"},{"date":"2018-06-19T00:00:00.000Z","text":"Ambience of the restaurant was nice and interior was stunning, crew was also friendly but the flavor of the food could be definitely improved, presentation and the portions were good, hope Nara Thai will improve its flavor very soon to the real Thai food standards","title":"Overall average experience"},{"date":"2018-06-19T00:00:00.000Z","text":"Authentic taste with very good ambience in fact one of the best designed restaurants in Colombo with a reception area to welcome you in. Food was very good very had many dishes and thought the pad thai was our favourite. Hope to visit again soon.","title":"Really tasty thai"},{"date":"2018-06-18T00:00:00.000Z","text":"The food was very tasty, specially the mango sticky rice. Good flavour. Great service. Hearty portions. Great experience!","title":"Best Thai Food we had"},{"date":"2018-06-18T00:00:00.000Z","text":"We had a. Wonderful time at the Thai Tasty restaurant. First class thai food and the staf were wonderful. We both had the penang chicken, very good indeed.great value for money and good service. We will back again🙈🙈🥂🙌🏻❤️","title":"Lovely thai food😍😍"},{"date":"2018-06-18T00:00:00.000Z","text":"Yesterday dinner i came to Nara with my girlfriend. when i enter to the restaurant its full packed . But they welcomed me in a nice way & gave a nice table. Ambiance was excellent . Staff was very friendly & good service . Food was delicious specially hot basil chicken. Definitely we will visit again.","title":"Nice Ambiance"},{"date":"2018-06-17T00:00:00.000Z","text":"We went there for ifthar buffet (to break fast) after 14h fasting had to stay 1 h for the food. Tasteless food. Just ripping the money. I won't step into that place in shaa allah","title":"Worst experience ever"},{"date":"2018-06-14T00:00:00.000Z","text":"Was attending a music event in the weekend and was famishing as the event dragged on till late night. Myself and wife wanted a proper Thai dining and wanted to try Nara for sometime.Had a bit of an issue in parking as there were only a few spots but managed to park on the street as the city life is slowing down on late weekend.Ambiance was great for a Thai dine-in as it had all the lighting and building materials right that signified\/screamed a Thai look. Was impressed at the welcome desk as they checked in and escorted us to a quiet table with the right temperature as we wouldn’t want to sit on a table freezing or too hot through out the meal.Assistants were helpful and quick but recommend you know the dishes before going in as they recommend the dishes that are on the list as it is “Nara recommended” and does not give a personal touch as to what they would know as the best..Ordering was not a hazel and the dishes came in quicker than expected which was delightful.I need to commend on the colors that was used on dishes and drinks as they had shades from Purple, orange, yellow, green etc. which enhanced the dining experience.Unfortunately the food tasted more towards a single pallet which gave more sweetness than a blend of tastes. It could have been due to wrong combination of selections but then the menu was not giving out proper information.Would recommend that Nara staff is more updated on the dishes and can give real time information on the dishes and to up the ante on the taste and they were more towards a sweeter and bland side of the pallet.Will visit again after some time to see how they have updated.","title":"Not up to expectations"},{"date":"2018-06-09T00:00:00.000Z","text":"This is my 2nd visit to nara ifthar buffet.it's simply the best thai buffet in town.the real authentic range of food prepared by the thai chef.the restaurant house full by 6pm. They got enough space of car parking facility as well.the staff is very friendly and they knows how to handle a huge crowd. The manager goes to each table to check customers satisfaction. Definitely worth for money.I will recommend this restaurant for everyone.","title":"Complete thai meal"},{"date":"2018-06-09T00:00:00.000Z","text":"Last week I visited to this place with my friends. Buffet was excellent, lots of variety of foods. Price also very reasonable. Separate area for players. Recomonded this place to others.","title":"Ifthar Buffet"},{"date":"2018-06-03T00:00:00.000Z","text":"I’ve eaten at several of their outlets overseas, but was unimpressed with our meal in Colombo. We ordered a watermelon juice and it looked and tasted off. They were nice enough to bring a second one. The red curry chicken was flavorful, but there was very little chicken and no vegetables to pair with. I ordered Pad See Ew, which is usually a flat noodle dish. However I got thin rice noodles. When I asked they said they only served flat noodles if requested, though the photograph showed the dish with flat noodles. The dish was not tasty, the noodles were lumpy, there was no sauté, and the prawns looked like they had been boiled and placed on the dish. The staff were very helpful and attentive. All in all, a very disappointing lunch at a comparatively steep price.","title":"Disappointed"},{"date":"2018-06-02T00:00:00.000Z","text":"The ifthar buffet was excellent selection of food at reasonable price ,I would recommend management to have this buffet after Ramadan on weekends onlyAs there very few halal restaurant with buffets on ordinary days , the ambience is excellent and staff are goodParking is available in plenty","title":"Ifthar buffet"},{"date":"2018-05-18T00:00:00.000Z","text":"Nara Thai is an international franchise and now can easily boast as one of the best Thai restaurants in Colombo, and situated in an ideal location in Colombo-03. The food is amazing! Only downside is the price ! Also very much HALAL!","title":"One of the Best Thai restaurants in Sri Lanka"},{"date":"2018-04-25T00:00:00.000Z","text":"Amazing Thai food as good as home. Variety choice of Thai cuisine and well presented as Thai ways. Must try.","title":"Taste of Thai"},{"date":"2018-04-14T00:00:00.000Z","text":"We took out some friends to Nara Thai who were lovers of thai food. The red curry chicken was good. Everything we ordered was tasty, The staff could not give us good food options as recommendations which I saw as a drawback.","title":"Great Ambiance"},{"date":"2018-04-02T00:00:00.000Z","text":"This is my third visit at Nara Thai, Visited the place with some of my office colleagues Sri Lankan and Swedish. We all enjoyed the delicious food. Service is at best.","title":"Continue to provide the best"}]