[
  {
    "date": "2018-07-09T00:00:00.000Z",
    "text": "Er has been 15 Businesspeople 40 or above and all off us travel a lot.Thaifood is known and loved.We ordered nearly everything on the menu and shared.The variety of beverages and food is enough.The quality and freshness is excellent!Nobody was able to try a dessert.We all liked the food very much and will come back.",
    "title": "Businessmeeting"
  },
  {
    "date": "2018-04-21T00:00:00.000Z",
    "text": "Very good combination Great yummy taste jesmin rice with Tom yum portion also good Service is best ...",
    "title": "Tom yum with jesmin rice"
  },
  {
    "date": "2018-04-05T00:00:00.000Z",
    "text": "The food is really good especially green curry and phadthai lots of vegetarian menu if you order to share the food is a lot for one plate but they do have set menu tooservice is very good service is good but only if you need to go toilet it’s not that clean",
    "title": "Lunch"
  },
  {
    "date": "2018-01-12T00:00:00.000Z",
    "text": "Some of the best Thai food I've ever had. Quick Thai has chefs that originate from Thailand and that is reflected in their authentic dishes.The Red curry is addictive and a must try.Service is good and ambience is very pleasant. Highly Recommended. Will definitely visit again.",
    "title": "Amazing Thai Food!"
  },
  {
    "date": "2017-12-31T00:00:00.000Z",
    "text": "Quick Thai has never disappointed us. They maintain their consistency so well, portion sizes are very good and excellent flavors. This is our go-to place for flavorful meals.We usually like to order things simple like jasmine rice and a green or red curry along with tamarind juice or maybe tom yum and pad thai.We open heartedly recommend their food.Ps- They do add lot of lemongrass and peanuts for certain dishes so if you have any allergies, you can always tell them to exclude these.",
    "title": "Best Sri Lankanized Thai"
  },
  {
    "date": "2017-10-21T00:00:00.000Z",
    "text": "We called in for a drink on a hot day. So this review does not contain a critique of the food, which we must say certainly smelt good!Service was a little slow. There were two waiters, but there didn’t appear to be a plan for the most efficient service. And being on two levels means that the waiters keep very fit!We got our cold drinks and were happy.",
    "title": "Service a little slow, but we left happy"
  },
  {
    "date": "2017-10-19T00:00:00.000Z",
    "text": "The service is very fast the order was ready in 10 minutes.The Phad thai was average nothing special.This is o k for a very quick take away.",
    "title": "Very Quick"
  },
  {
    "date": "2017-10-13T00:00:00.000Z",
    "text": "The food was yummy and had an authentic Thai flavor to it. However, the food portions were small in quantity and took a little extra time for the service. But would want to visit their once again to try out their other dishes.",
    "title": "Yummy Thai"
  },
  {
    "date": "2017-09-04T00:00:00.000Z",
    "text": "Nice little clean place with calm atmosphere. their service is really quick and no any other restaurant has served so fast. Food is good and loved their Tom yam soup. Need to attend to more detail in cleanliness. The table which we were in with few ants. Nothing major to complaint about.",
    "title": "Extremely quick....."
  },
  {
    "date": "2017-08-29T00:00:00.000Z",
    "text": "Have visited the place several times come times back and visited very recently and saw a very big drop in the service and food was not good at all. We waited almost an hour for the food to arrive and staff was acting very clueless. Food didn't taste well at all. The fish red curry was very sweet and was not pleased. Will not visit again.",
    "title": "Name says its Quick Thai but Not Quick at all!"
  },
  {
    "date": "2017-08-12T00:00:00.000Z",
    "text": "Went to the restaurant with my son and wife for dinner. Simple decor with views of the adjacent tennis court.We ordered a thai green curry chicken, kankun???, Buttered cuttlefish, this pork, egg fried rice.The cuttlefish dish has mostly carrots and peppers.(see pic) The green Thai curry did not have many chicken pieces though the liquid was plenty and tasty. The pork was tasty and adequate.We spent about SLR 4500.00 which is about £25.00. So not cheap and similar price as Wagamamas.",
    "title": "Tasty but small quantities"
  },
  {
    "date": "2017-07-28T00:00:00.000Z",
    "text": "It wasn't quick as name suggests but food was excellent. Small menu- of course it had many items but they all fell into a few recipes.Food had a stronger flavor than the original Thai cooking- bent towards Sri Lankan preferences. It was nice.Service was slightly under par. Waiter didn't exhibit that much of excitement about having customers (even if we were only customer at that point) or didn't seem to be proud of serving.Ambient was nice.",
    "title": "Stronger flavors than authentic cuisine"
  },
  {
    "date": "2017-07-19T00:00:00.000Z",
    "text": "We visited quick thai with family while visiting Sri Lanka and enjoyed the experience immensely. The food was simply amazing with the highlight being the Thai red curry. I live in Malaysia where Thai food is fairly commonplace but can safely say the meal at quick thai beats anything I've had in Malaysia. Service was great and the ambiance relaxed. Highly recommended and great value for money. Check it out if you love Thai food.",
    "title": "Authentic, Value for Money Thai"
  },
  {
    "date": "2017-06-15T00:00:00.000Z",
    "text": "Quick Thai is a cute little space with smiley wait staff. The food has a Sri Lankan twist but was so on the money for taste I revisited twice more within a week. Perfect set menus for work lunches. Id recommend the fried rice with basil chicken though the deep fried egg with it tends to be overdone and quite unappealing. I ask for a less fried egg and theyre happy to oblige. The coconut chicken soup is rich but tasty and the chicken noodles are a total crowd pleaser. A solid three stars! Just get that egg changed!",
    "title": "Tasty food with good service"
  },
  {
    "date": "2017-05-15T00:00:00.000Z",
    "text": "Tried the red prawn curry and the green chicken curry along with some steamed rice wow we loved the taste it's a good place to have a quiet Ck Thai meal",
    "title": "Value for money"
  },
  {
    "date": "2017-05-02T00:00:00.000Z",
    "text": "Place located very closer to D.S. College ground. Charming place with very decent atmosphere. Dining area is nice and clean.Their menu is very interesting and the food is really delicious also they are actually using Thai ingredients.Nevertheless I personally appreciate their service.One can enjoy their Thai meals at the place or can take away. Meals come with different kinds of juices and soft drinks.But it would be nice if one can enjoy a beer with some hot Thai food.8\/10 cheers!",
    "title": "Delicious Thai food for affordable prices"
  },
  {
    "date": "2017-04-16T00:00:00.000Z",
    "text": "Did not changed just the good things became better . Still love the food Stuff is friendly and the prices did not raise like in the other restaurants.",
    "title": "Finaly again there"
  },
  {
    "date": "2017-03-28T00:00:00.000Z",
    "text": "Expectations are high of a diner when they visit a specialty restaurant. That is what we too had when we decided to have authentic Thai cuisine. Selected \"Quick Thai\" to fulfill that dream!For a dinner outing the location was good even though it faces quite a busy street during the day time. Cool and comfortable. Ambience was all right. However, the menu could not offer any thing that we felt special to make this restaurant stand out from the other Thai restaurants in town. In fact what we noticed was a mixture of Thai and \"Sri lankanised\" Chinese style dishes in the menu. It causes confusion, as in some Chinese restaurants too we have observed familiar names in the menu to identify what they call Chinese dishes. May be Quick Thai prepares it in the Thai way.We were able to select some to flavour but there again a mistake that had occurred some where after the order was given deprived us from comparing the taste of the noodle based version against the rice based version of what we ordered as both items had been prepared with rice. In general, the dishes we tasted were all right.",
    "title": "Location is good menu is not"
  },
  {
    "date": "2017-01-29T00:00:00.000Z",
    "text": "Went with Family on the 29th of Jan 2017. We were a party of 16. Total cost was 26,000\/-. Now for some this would be a reasonable price but if You've had a meal here, seen what we ordered, tasted what we had then you know this is a MAJOR rip off.Food sucked. Tasted like someone had split a bottle of sugar into the food. Everything was super sweet. No need for dessert. Staff did not understand the basics of writing down an order.Took 40mins for drinks to arrive and 1hr and 5 mins for the food arrive. Server first served the Pad Thai, Spicy Rice and Sticky Rice. We were so hungry that we had eaten it all by the time they brought the Red and Green pork curry.Pad Thai had random strips of Chicken and the Red\/Green curry maybe had 3 pieces of pork per bowl and a whole lot of green peas.Since there was someone in our party celebrating their birthday we had a cake brought from outside. To go with this we decided to order ice cream. Somehow the server managed to screw up the order and when he finally got around to serving it was with Plastic spoons.From the whole ordeal the worst things for me is that the cutlery was...... UNWASHED. 5 of us got spoon that were previously used and unwashed. Still had curry from the previous meal.We payed way to much for what we received. Much better Thai places in Colombo where the price is less and the food is good but Quick Thai is absolutely definitely not one of them.",
    "title": "PLEASE WASH THE SPOONS"
  },
  {
    "date": "2017-01-29T00:00:00.000Z",
    "text": "Best Thai ever and the service is great too. The food arrives fast and it's tasty. The guys are super efficient to get us a table and take orders. We dined here thrice dying our short visit to colombo in December 2016. Great value for money too. The green and red Thai curries were the highlights for our family.",
    "title": "Quite a gem tucked away in Colombo"
  }
]