[
  {
    "date": "2018-07-10T00:00:00.000Z",
    "text": "We wanted to eat somewhere with authentic Sri Lankan cuisine and this place our guide recommended was perfect! We had the traditional vegetable curry 9 dish plus rice set and a fruit platter for pudding (all made suitable for us as vegans). Everything was delicious, authentic and natural. More than enough food was on offer and the prices and ludicrously inexpensive. Lovely staff and service and we even got a ride home to our hotel afterwards. Comfortable open walled restaurant. Lovely dinner thank you!",
    "title": "Authentic and delicious"
  },
  {
    "date": "2018-07-09T00:00:00.000Z",
    "text": "I had some of the best Sri Lankan rice & curry I've ever had. A wide variety of different vegatarian plates was served, all of which tasted amazing. The owner even dropped us back at our hotel.",
    "title": "Great place, good food & friendly staff"
  },
  {
    "date": "2018-07-03T00:00:00.000Z",
    "text": "We checked this place out when we visited Sigiriya Rock. Such a charming family owned place with amazing Sri Lankan fair. Our tour guide, George, was also impressed. Love the signatures on the walls. We left our mark in hopes to see it again when we come back to Sri Lanka.",
    "title": "Great Sri Lankan Home Cooked Meal"
  },
  {
    "date": "2018-07-03T00:00:00.000Z",
    "text": "We had a delicious dinner with our family in Rithu restaurant. Typical Srilankan fingerfood. Not to spicy, for us Belgians.",
    "title": "Rithu restaurant"
  },
  {
    "date": "2018-06-30T00:00:00.000Z",
    "text": "Rithu Restaurant served my favourite curries so far in Sri Lanka! The mixed Sri Lankan curries is a very generous serve of fresh and delicious food, and had eight different things to try! My family were very happy with the Western options too.A lovely family runs it and works so hard. Definitely worth stopping by.",
    "title": "Great Dinner!"
  },
  {
    "date": "2018-06-28T00:00:00.000Z",
    "text": "Amazing traditional Sri Lankan food, with gluten free, dairy free and vegan options available. Clean and tasty. We requested the food we liked and he the chef made it in minutes. it tasted fresh and authentic .",
    "title": "Gluten Free, Dairy Free & Vegan options"
  },
  {
    "date": "2018-06-28T00:00:00.000Z",
    "text": "This restaurant is isolated from the others in Sigiriya (near the rock), so was a little difficult to find. The food was nice but nothing special and nothing like some of the other local curries we enjoyed.",
    "title": "Nice food"
  },
  {
    "date": "2018-06-24T00:00:00.000Z",
    "text": "Place is very nice and chill with all green around,the family is so warm and friendly.Food are amazing! 😃 I had rice and curry,one of the best in Sri Lanka.Just prices are touristy,but it absoluetly worths for these nice smiling service and so delicious food.",
    "title": "great food,so warm hospitality"
  },
  {
    "date": "2018-06-14T00:00:00.000Z",
    "text": "Sam and family, thank you so much for your welcoming hospitality and amazing food that we could not get enough of.... hence we ate there again the following evening. Wishing you a happy and successful future at your beautiful restaurant.Dreaming of your banana flower curry all the time!!!The happy South African Sisters!",
    "title": "Better that the best"
  },
  {
    "date": "2018-06-14T00:00:00.000Z",
    "text": "Great place for Traditional Sri Lankan food on the way to Singriya Rock sign out the front states Tourist Freindly and approved (Gov approved)we had several Vegie dishes & curries fruit platter at the of our meal. Meal was beautifully presented and all home grown fresh and cooked by SamanthaAnd his wife, he was previously working as a chief in high end restaurants Very reasonably priced.There is a higher platform( like a tree house) at the front of the restaurant try to sit up there if it's not to hot. Bathrooms are super clean. Highly recommended ..Don't forget to write on the wall. !!",
    "title": "WRITING ON THE WALL"
  },
  {
    "date": "2018-06-13T00:00:00.000Z",
    "text": "We found this on TripAdvisor and it was a true gem! The owner was a chef for a hotel and 2 and a half years ago set his own restaurant up. They were very hospitable and we would highly recommend them. We are actually considering returning tonight.",
    "title": "A True Gem"
  },
  {
    "date": "2018-05-28T00:00:00.000Z",
    "text": "My friend and I recently ate here one evening whilst on a TripADeal tour. We decided to depart from the hotel and eat at a local restaurant which I had read good reviews about. Leaving the hotel by Tuk Tuk in the evening meant negotiating the roads at night and the elephants!!!! Quite an exhilarating ride but well worth it as the traditional Sri Lankan curry we ate here was really delicious. I recommend this restaurant highly if you are in the area for quality meals and friendly service. The chef and his wife both waited on our table and it was a lovely experience.",
    "title": "Delightful family run restaurant"
  },
  {
    "date": "2018-05-25T00:00:00.000Z",
    "text": "Lovely little family restaurant with great ambiance, food was fantastic and fairly priced, friendly family service kids playing around adds to the family vibe, vegetable and chicken curry was excellent as was the Dahl, a little drive out of the main strip of sigriya but well worth it",
    "title": "Excellent food and service"
  },
  {
    "date": "2018-05-23T00:00:00.000Z",
    "text": "For me it was the best Sri Lanka food I had and I am now the fifth time in Sri Lanka. The family is very friendly and the prices are good. Er will come definitely come back.",
    "title": "Awesome food"
  },
  {
    "date": "2018-05-15T00:00:00.000Z",
    "text": "After a great morning climbing Lions Peak we were in the need of lunch. Our driver recommended Rithu. It was empty when we arrived but a gentleman greeted us with a warm welcome and took our order. The food was delicious. 9 bowls of vegetables and meat came out and the flavours are just great! Would definitely recommend and very good value for money also.",
    "title": "Great lunch"
  },
  {
    "date": "2018-05-15T00:00:00.000Z",
    "text": "I had the Sri Lankan dish option, which was a selections of curries. The food was outstanding and the prices are very reasonable. I would go back here every day of I could.",
    "title": "Genuinely best food I've ever had"
  },
  {
    "date": "2018-05-14T00:00:00.000Z",
    "text": "Visited this restaurant whilst staying at the Kassapa Lions Rock. Amazing food, great service, nice atmosphere. Vast improvement on the hotel food. Need I say more.",
    "title": "Amazing food!"
  },
  {
    "date": "2018-05-04T00:00:00.000Z",
    "text": "We found Rithu Restaurant in Sigiraya thanks to our driver Tusita from SLD Tour. It has european, chinese and sri lankan menu. The restaurant is run by a family, and we're informed that Rithu is the name of the daughter. All over the place is very clean and nice. The owners speak English and with them we spoke about Sri Lankan food. We ordered Sri Lankan food, chicken curry with rice and they had served the meal with a lot of side dishes which can be eaten as main meals too! The food is so delicious that I can't forget the taste. The sambal, the dhal, the curry with fresh coconut, the ocra, the pumpkin with curry sauce.....At the end they also served us fruit which was very fresh.... The service is very good and the owners very kind. The prices are very reasonable... Rithu is the best place to eat in Sigiraya.",
    "title": "Michelin star"
  },
  {
    "date": "2018-04-23T00:00:00.000Z",
    "text": "The place is real nice, the service was good and the food was even better i would say is amazing, . You can feel the spirit of Sigirya. Totally recomend!!",
    "title": "Amazing experience"
  },
  {
    "date": "2018-04-21T00:00:00.000Z",
    "text": "This lovely restaurant kindly opened early for us and our hungry kids. We were served a vegetarian feast of delicious Sri Lankan food, all delicious and had us eating until we were stuffed. The eggplant, Dahl and an amazing dish of coconut and greens were particular highlights. The host thoughtfully brought a plate of fruit for dessert and offered us a lift home. We felt very welcome and highly recommend this place to visitors.",
    "title": "Family friendly vegetarian feast!"
  }
]