[{"date":"2018-11-12T00:00:00.000Z","text":"One of our favorite hotels in Australia. worth it for the views of Darling harbour. Marble bathroom with separate bath and shower, yes! Hope it doesn't change. We were here for 3 nights and wished it was longer. Keep up the good work.","title":"Back again"},{"date":"2018-11-12T00:00:00.000Z","text":"This is a great hotel ideally situated for exploring the Circular Quay area of Sydney. Just on the fringe of the area but very quick and easy walk to the Quay. Very friendly and helpful staff. Nicely appointed room. First rate all the way.","title":"Great hotel"},{"date":"2018-11-12T00:00:00.000Z","text":"It's been 25 years since we last stayed at the Shangri-La and we enjoyed just as much as the first time we stayed there! We did have a wonderful accommodation package (Fine Hotels and Resorts), which included a 4pm check-out, so our overnight stay felt more like 2 days. We're locals, but I really like the hotel's location - 5 minutes walk from the Rocks, 5 to 10 minutes walk from Circular Quay \/ Opera House, and 10 to 15 mins walk from Barangaroo Reserve. For first-time tourists, it's helpful to get some directions how to most quickly walk to these beautiful locations.The service was exceptional - everyone we interacted with was friendly and efficient - and we even got a lovely birthday cake for the occasion, which was a nice touch.The view (grand harbour view) was of course exceptional. The buffet breakfast was diverse and good quality and you can also order a range of a la carte options as well.Cafe Mix for dinner was good without being great - as it was a Sunday night, the more upmarket restaurant was closed.The room was lovely and certainly met expectations - the bed was very comfortable and the window seats allow you to fully experience the view.The gym looks great, and the indoor pool and spa were both really relaxing, although the pool surface is showing its age slightly and probably needs resurfacing at some stage --- the ceiling above the pool is probably an opportunity to make the pool area feel some more spectacular (ie, it could do with a re-paint and some pizzazz), however, overall, it didn't at all detract from our enjoyment of this area.The Blu Bar was fine and had a nice vibe, together with its fabulous views.Overall, we'd stay again, as we enjoyed the experience.","title":"Relaxing stay in a hotel with stunning views"},{"date":"2018-11-11T00:00:00.000Z","text":"The hotel has a wonderful view. The locations is fantastic, walking distance to everywhere. However the staff is not very helpful. The blue bar however is not great service. The stuff was not helpful at all.","title":"Great View"},{"date":"2018-11-11T00:00:00.000Z","text":"The good points. The room was well appointed and looked after, very clean and comfortable bedding. It was possible to block out most the little lights which are so often disturbing in the night. And pretty quiet despite the odd late night guest passing by. Breakfast very good if pricey. Views from the higher rooms are impressive across the harbour. So why only 3 stars... well frankly I find insisting on taking 100 dollars a night deposit off my credit card on a company booked and already paid for stay for “potential damages and extras” both outrageous and insulting. And the location isn’t the best up a series of steps at the back of the Rocks next to the freeway. Sorry.","title":"A good hotel but not the greatest"},{"date":"2018-11-11T00:00:00.000Z","text":"The Shangri-La Sydney’s location is almost perfect. The only word of caution I’d add is that some might think it a bit of steep walk back up from The Rocks but the landscape is what it is?The hotel is superbly appointed and the quality of its facilities and fittings is immediately evident on checking in. We had a 9th Floor room on the ‘Opera House Side’. The view was evident as was the soundproofing. The bed was the most comfortable hotel bed I’ve experienced.The staff were fantastic from the housekeeping department responsible for cleaning the rooms through to people based in the pool\/spa, the restaurant\/room service staff and those who worked in Reception\/Concierge. They were, without exception, polite and diligent. The service was exceptional and we won’t hesitate to stay there again. There are some other notably good hotels in Sydney (e.g. the Grace Hotel and Swissotel) but the Shangri-La had just about everything and its location suited us better.","title":"Best stay in Sydney?"},{"date":"2018-11-08T00:00:00.000Z","text":"The hotel location is great, in a very nice area of Sydney and short walk everywhere.The room was clean, room service very quick and tasty, bed comfortable.The general service though a very standard - minimum effort to meet needs. No warm welcome, did not wish us a happy anniversary, did not offer a coffee while we waitied for our room to be ready. When we asked for a casual dining recommendation nearby she sent us to Cafe Mix which is not casual dining.We asked for a quiet rook when booking as it was our first night away from kids so wanted a good sleep. They put us only on level 7 so I could hear the highway and had to wear earplugs.We booked the opera house view room and could just see it if standing from an angle at the window so hardly worth it.They brought a plate of fruit but it wasn't seasonal, just apples. (Some berries and melons are in season at the moment for example).All in all I can't technically fault them as technically they did everything they were required, but I would expect a hotel like this to give a little extra on terms of staff.","title":"Beautiful hotel, minimum service"},{"date":"2018-11-08T00:00:00.000Z","text":"This hotel was the 2nd leg of our holiday and we stayed 25th - 27th Oct 2018, on a B&B basis, prior to boarding the ship.The only thing I can about this hotel is that it was better than excellent. It had a friendly ambience and our large room overlooked the bay. Wonderful.","title":"Top hotel near the Passenger terminal in Sydney"},{"date":"2018-11-08T00:00:00.000Z","text":"We were here for 6 nights. The room was lovely, brilliant views of the Harbour and the opera house. A couple of minor misunderstandings were cleared up very quickly . However, I resent being charged extra for breakfast as this is a very pricey hotel. If you registered the night before it cost less and , I have to say, the breakfast wasn’t that great. Quite a lot of choice but it was all mass produced and if you ordered at your table it wasn’t freshly made but just picked up from the displays. The staff were generally good though the wait staff in the cafe, where we went for a coffee one afternoon , had very little English and messed up our order. Also be aware that the spa offers only limited treatments, no manicure or pedicure for example was available .","title":"Great location good service"},{"date":"2018-11-06T00:00:00.000Z","text":"We recently stayed at the shangri la this is the third year to stay here. We come down for our anniversary and its always great the staff are all so helpful and friendly. The rooms are always clean and decorated well.the things that make this place great are the little things like in the bathroom they supply toothbrush and toothpaste and other little things a bottle of water beside the bed everynight. They also come turn down your bed get it ready these little things make it great. Then there is the view it must have one of the best views in Sydney. This year we splurged and got a better room but even the view from the cheaper rooms is great. I would highly recommend that you stay here if staying in sydney","title":"Magical views"},{"date":"2018-11-05T00:00:00.000Z","text":"After staying around the world in 5 star hotels, plus lecturing in tourism\/hospitality for many years I must admit that the Shangri-La in Sydney is a bit of a disappointment. We booked for 7 nights and have a couple more to go...The good points are : hotel is in a great position, nice rooms with views - very comfortable beds and pillows.But for the price it lacked some areas that should always be available at a 5 star hotel.1. Better quality coffee, hot chocolate and tea sachets available in room. At the moment the tea and coffee available is very poor and no hot chocolate (we tried to even order a hot chocolate via the concierge but apparently hot chocolate isn't available and cannot even be ordered through room service!).2. No free movie channels. I understand that for new movies you need to pay, but even 3 star venues have Foxtel or Netflix movie channels available.3. Poor facilities if the Blu Bar is being used for external functions. There is nowhere to go except ground lobby area if the Blu Bar isn't available - we tried to go for cocktails twice over the past couple of days but it wasn't available to house guests due to private functions (yes, we did come during Melbourne Cup time) but the staff we met at the Blu Bar were not interested in providing us any alternative options (they didn't even ask if we were guests), in fact as guests of the hotel we felt that we didn't have anywhere to go in the hotel so we went out every day and evening for our meals and drinks.These few areas make the Shangri-La look like they are trying to cut costs on small, simple customer services.Looking at other reviews I'll probably get a generic response to this review - but hope the management take note because this hotel is lacking what other Shangri-La hotels excel on - customer service and facilities.I'd love to come back but after this experience will look at other 5 star options.","title":"A Disappointment."},{"date":"2018-11-05T00:00:00.000Z","text":"Coming from WA, as well travelled international traveller, I chose this Sydney Hotel, as I had experienced Shangri-La, in both Singapore & Dubai and knew its reputation was exemplary. I have experienced serious disappointment since I checked in. Whilst the hotel boasts great views of the Harbour, I have tried on 2 occasions to experience the views from the Blu bar on the 36th floor but was let down, staff were rude on 2 occasions. When I enquired if there was any in-hotel events for Melbourne Cup day, I was told by 2 staff members, there were none. On the day of \"the race that stops the nation\", I returned to our room at 2pm to freshen up, but my room was being cleaned. I returned twice within 1\/2hour, but the room still was not ready. So I headed up to the Blu Bar for a quick cocktail whilst I waited, to find there was in fact a Melbourne Cup function happening in the lounge area of Blu Bar, whilst the actual bar area was empty - to be told no, the area was closed. I was not given any alternative. I am less than impressed with the quality of coffee\/tea supplies in the room, no coffee machine or pod appliance to boast of, no Hot Chocolate sachets available. No in-house movies, not even a smart TV to play my own movies via my own devices. My friend wrote a letter of complaint to the MD but have had no reply. After checking other reviews, I note all responses seem generic. Very expensive and very disappointing hotel I expected much more from a 5 Star Hotel.","title":"Disappointment Plus"},{"date":"2018-11-03T00:00:00.000Z","text":"I booked this room through the American Express travel site expecting 5 star service.We arrived an hour early so happy to have a drink while we waited to be called.After an hour waiting my husband had to wait in a queue again to be told the room was not ready. Of course he was annoyed, we were celebrating our 25th Anniversary and wanted everything to be perfect.We were given a room on the 5th floor with partial harbour views .It looks like they reserve the good floors for overseas travellers.No acknowledgement of our celebration which I mentioned in the booking and the room quite small made me feel even more disappointed.We were offered a late check out but when you start off like that you don’t want to spend more time in a place so unwelcoming. I suggest they hire more senior staff, with more experience & knowledge who know how to greet and handle travellers with high expectations.Definitely staying at the Westin next time.At least they offer and deliver 5 star service every time and cater to the Australian market.","title":"Disappointing start"},{"date":"2018-11-02T00:00:00.000Z","text":"My husband booked us for 2 nights to celebrate our 20 year wedding Anniversary. We had a harbour bridge and opera house view . It was amazing watching cruise ships leaving in the afternoon. We were on the 7th floor which had a lovely view . The room was big and very comfortable. The marble bathroom was awesome . We had Buffett breakfast included which was delicious with lots of choice , a menu you could choose some items from included in price and espresso coffee made to order . Blu bar on 36 was a bar with fantastic views and cocktails . We watched the sun set over the Blue Mountains. The service was excellent. The royals were staying at the hotel during our stay and the way the staff handled it all well as seamless . Would recommend staying there if you are looking for somewhere special","title":"2 night stay for 20th wedding anniversary"},{"date":"2018-10-31T00:00:00.000Z","text":"As a Sydney-sider i only have had the luxury of staying here for one night. but it was great - we were upgraded to a suite, the staff were fantastic and it's centrally located. We also had beautiful views, the cocktail bar is also amazing!","title":"Nice for a romantic stay"},{"date":"2018-10-29T00:00:00.000Z","text":"Where do i start. From the moment we arrived to the moment we left it was an amazing stay. The staff were amazing. The room fantastic and the bed so comfortable.The Horizen Club was fantastic. The Horizen Club staff so professional and caring. The food was great. The view was fantastic from our room and the Horizen Club. Nothing was to much trouble for anyone. Will definatley stay there again on our next trip to sydney and will highly recommend it to anyone wishing to stay at The Rocks. So close to Circular Quay and the ferries. So travel to anywhere was easy.","title":"A trip to remember"},{"date":"2018-10-28T00:00:00.000Z","text":"I was disappointed that when not booking directly with the hotel website or app that Golden circle points are not applied, usually a hotel will offer a best rate garuntee when booking direct, however the 3rd party had a much cheaper rate. In saying that, we were lucky enough to receive an upgrade to one of the newly refurbished club rooms. It was nice, and as you would expect from Shangri-la. The only negative was the smoke alarm light in the entrance flashed constantly so at night for someone who requires complete darkness to sleep it was a bit annoying. I could see previously some black tape must have been put over it but has since been removed. It's a catch 22, obviously it needs to be there for safety reasons, but at the same time it is a bit of a pain.If we hadn't been to the Shangri-la in Hong Kong I probably wouldn't have been as underwhelmed with Sydney, the HK one has a lot of chandeliers and for the extra outlay this could make quite a difference to the feeling of luxury in Sydney. The staff were all friendly and helpful, including assisting with directions even when the Royals were inbound. Breakfast was great with lots of options. We dined at Altitude restaurant and the food, service and view was fabulous, though as expected the prices matched. It was nice that they were able to accommodate us with no prior booking. There was a much needed lift upgrade in progress. The location was great and one of the reasons for booking the hotel.Would we stay again if in Sydney; yes.","title":"Lovely hotel, great location"},{"date":"2018-10-28T00:00:00.000Z","text":"There is a great deal to like about the Shangri La. We had a wonderful room with a small, separate sitting room, and a view of the harbour we will never forget. The location of the hotel is good - very central for the harbour and shops, though quite a climb back up.The breakfast was what you would expect of 5 star hotel. However, the service lacks the warmth and personal touch we have come to expect, and to love ,about Shangri La's around the world. It is small things - but it is the things which make Shangri La stand out for us usually, but not this time. This should not put you off staying here though - it is an excellent hotel, with a a great location","title":"Excellent hotel somehow missing the SL touch"},{"date":"2018-10-25T00:00:00.000Z","text":"One cannot help being a little bit disappointed that the Shangri-La is not the luxury institution one expects. It is an adequate business hotel with good service, large and clean rooms and a very comfortable bed. The gym\/pool is not bad either. It is reasonably central for Circular Quay and the central business district, but quite a bit of a hike up the hill from the harbour. The breakfast is nothing special and expensive for what you get. Good for business, but a bit dull and tired for discerning holiday makers.","title":"Adequate and comfortable business hotel"},{"date":"2018-10-24T00:00:00.000Z","text":"Nice as building. I had a case which could have been handled diligently yet got a very arrogant response in chique words and a meaningless smile. Very dissapoonting ending to a stay in such a nice city.","title":"Never again"}]