[{"date":"2018-07-21T00:00:00.000Z","text":"Visiting the Sigiriya Rock is definitely one of the highlights when touring Sri Lanka. The ancient capital city built on a rock as a fortress by a rebellious monarch has many fascinating stories from the past. The architecture and facilities cannot simply be comprehended considering the era that it was built, due to non availability of heavy machinery during that time. One side of the rock is yet to be explored and it is reported that excavations in new areas have commenced with new artifacts being unearthed. It was pleasing to note that new facilities have been introduced to visitors. It is recommended to be at the gate early morning to enjoy a leisurely and less crowded climb to the top.","title":"A must visit when visiting Sri Lanka"},{"date":"2018-07-20T00:00:00.000Z","text":"i must warm! that my rating is unfair since i did not actually climb. What frustrated me even more is after driving through half a day from Colombo, my travel guide recommended me to not climb up the stairs as it was risky, over priced and difficult for kids.Outside view is not as spectacular as photos show. If you are planning your trip with young kids\/aged parents you are spend time and money on other things. If you are young couple, and willing to spend some extra dollars than you may try it.","title":"Disappointed with distant view!"},{"date":"2018-07-19T00:00:00.000Z","text":"Impressive, amazing and a must seen. Unfortunately a bit overcrowded. But still worth to see and to climb up to the Lion‘ rock.","title":"Amazing but overcrowded"},{"date":"2018-07-14T00:00:00.000Z","text":"I was lucky to have guide otherwise you might just be walking around and don't get the full history of the place. I was lucky the sun was not beating down so it made walking up the 1200 steps bearable. Certainly the view from the top is worth going up. The remains of the lion head and rock paintings were worth the walk. Check out the sanscript carving on the mirror wall.","title":"Reccomended"},{"date":"2018-07-13T00:00:00.000Z","text":"Excellent Experience 💯 Sigiriya today is a UNESCO listed World Heritage Site. It is one of the best preserved examples of ancient urban planning","title":"Sigiriya Lion's Rock"},{"date":"2018-07-12T00:00:00.000Z","text":"This is well worth the time and effort for an amazing experience at the end of the climb. The crowds were thin on the day we climbed and that probably made it much easier than those who do during the busy months. I would suggest a guide who can explain everything that you see as this really enhances the experience and because things are not well sign posted. There are some very precarious stages and those with vertigo will enjoy a crash course in overcoming it. The wall paintings are good to see on the way up but the real delight is the view at the top. A word of caution, on the last few hundred stairs you \"will\" be offered help by \"guides\" laying in wait. I strongly recommend firmly declining as they will be asking large amounts of money for assisting you with the last few steps. The history and view make the effort well worthwhile.","title":"Not just because it is there!"},{"date":"2018-07-04T00:00:00.000Z","text":"This is an Amazing place on earth. Probably the 8th wonder of the world. Get Travel Guide's assistance. They will explain you all the details and show you all the important places.Ideal time is morning. Getting hot at noon and afternoon. Bring extra water bottles and dont forget a hat \/ cap.On the top, you can see the Pidurangala rock.You will NOT allowed film\/video\/photograph Sigiriya Drawings. Also Beware of the Monkeys. They will take your bags and belongings. Beware of the Wasp.","title":"Amazing ! Eighth Wonder of the World!"},{"date":"2018-07-04T00:00:00.000Z","text":"Whilst pricey to get in at 30USD, the site is amazing. The gardens by themselves are a fascinating and in an impressive condition and as you climb up the rock itself the frescoes are stunning.The views and ruins at the top are worth the additional climb.","title":"Outstanding"},{"date":"2018-07-03T00:00:00.000Z","text":"First you can go to Museum to buy tickets for this area. Places were very beatiful, Green and clean. You can take very nice photos here. You must go true gardens before climbing to lion rock.","title":"Grate historical place"},{"date":"2018-06-26T00:00:00.000Z","text":"Probably the best touristic site I have visited whilst in Sri Lanka. Beautiful garden leading up to the rock with its ancient palace right on top of it. Lots of steep stairs before your reach the top but your effort will be rewarded with breathtaking views","title":"Amazing UNESCO World Heritage site"},{"date":"2018-06-26T00:00:00.000Z","text":"This is not an easy walk, however if you have some level of fitness it is definitely worth it. Both to see the ancient relics and the magnificent views. It's advisable to go early in the morning to beat the crowds.","title":"Sigariya"},{"date":"2018-06-26T00:00:00.000Z","text":"Very well maintained, definitely worth the climb. Lots of places to stop on the way up, so no need to worry about your level of fitness. Worth going early to beat the crowds","title":"Worth the money"},{"date":"2018-06-20T00:00:00.000Z","text":"Our guide suggested we got up early and went while it was cooler, which was a great idea, as even at 7am it was still very warm! It took us about an hour and a half, up and down and it was well worth it. The view from the top is beautiful and its really fascinating being up there, we were lucky enough to have our wonderful guide with us who could tell us everything about it","title":"Bit of a hard climb, but well worth it"},{"date":"2018-06-19T00:00:00.000Z","text":"Don't miss this incredible site. Go early to avoid the crowds. Wear comfortable shoes. Take your time. Watch the sunset from the top.","title":"Seeing is believing"},{"date":"2018-06-19T00:00:00.000Z","text":"Amazing Ancestors in Sri Lanka with King KASHYAPA made this rock to a castle with unbelievable technology","title":"Sigiriya"},{"date":"2018-06-16T00:00:00.000Z","text":"If you look at photos of this place in guidebooks, you could be mistaken to believe that the walkways up this magnificent rock are planks of wood and ropes - they are NOT! They are all either stone steps or firm metal walkways with good handrails. That said, I wouldn’t be keen to let small children run free. We are a relatively unfit couple in our 50s and we were up and down in about 1.5 hours without difficulty.The experience is amazing. The views are magnificent.TIP. Set off early to avoid crowds and heat. We were in the car park by 8.30 which was about right.You don’t have much option but to experience the whole route as there isn’t anywhere to divert to on the way. There is a spiral staircase half-way up which takes you up (and back down) to see some amazing frescoes.The last bit is also pretty easy from the lions claws up to the summit. There are some amusing signs en-route!","title":"Don’t be scared it’s easy!!"},{"date":"2018-06-15T00:00:00.000Z","text":"An absolutely stunning World Heritage Site. The best time to visit is very early in the morning to avoid the crowds.","title":"Absolutley stunning!"},{"date":"2018-06-15T00:00:00.000Z","text":"This is a UNESCO world heritage site. Most suitable time to witness the beauty is early in the morning, because with the brighten sun light temperature increases. Once entered into the top of the rock you can have a 360' view of the surrounding, can witness the beauty of ancient irrigation systems.","title":"Beauty of Ancient Defense Architecture"},{"date":"2018-06-08T00:00:00.000Z","text":"We visited the rock from Kandy on a day trip, took about 2.5 hours to get there, and paid for tickets on the door, was 4770 rupees.We were advised to try and climb before 0930 but due to the journey arrived late. We actually found the rush had died down and at one point (11AM) we were one of about 6 people on the top! Which was great for photos.The climb is fine, possibly a little hairy for those scared of heights, but stairs the whole way. Not particularly physical with 3 places to stop on the way if required.The site of the old kings quarters itself is much larger than I expected and great to view. The associated sites at the bottom are equally interesting and multiple.We spent around 4 hours here. Would say it is a must do for Sri Lanka!","title":"Scenic historical climb"},{"date":"2018-06-08T00:00:00.000Z","text":"This is an absolute must-see if you are in the area of Sri Lanka. Climbing up a lot of stairs can be tricky in the heat, and it can be exceptionally busy (especially on religious holidays). Higher up the rock, the metal stairway nailed into the rock looks like it cannot hold the endless stream of people. The views from the top are absolutely stunning and worth the climb.","title":"Great Experience, Fantastic Views"}]