[{"date":"2017-07-12T00:00:00.000Z","text":"Went there for dinner on Saturday. No crowd as well. Had to wait almost 45 mins for drinks and appetisers. Ordered prawn toast, tom yum and noodles. Service was very slow and waiters seem uninterested. Not what you want your weekend dinner to be !","title":"Not good at all"},{"date":"2017-06-20T00:00:00.000Z","text":"Great food for a resonable price. Good staff as well. I can recomend their soups and noodls items. Good place for friends to hangout","title":"Great food and great place to hangout"},{"date":"2017-06-19T00:00:00.000Z","text":"Pleasant atmosphere and efficient customer service. They maintain a good standard throughout all of their restaurants and quality of food is great. Ideal place for a casual meal.","title":"Casual"},{"date":"2017-04-23T00:00:00.000Z","text":"The food took about an hour to come 1\/2 hour for the waiter to take the order, he was in such a hurry, the food was amazing though the tom yum had a tad bit too much salt.The place looks like your average normal Chinese place.","title":"Bad experience"},{"date":"2017-04-20T00:00:00.000Z","text":"I don’t mind spending lavishly when eating something really good. Their restaurants at Mount Lavinia and Nugeogoda did serve good cuisine for lunch and dinner. But yesterday we ordered and delivered some takeaways from the Mt Lavinia branch (bill around Rs 1319 – refer to the photo) ordering a standard portion of vegetable chop suey rice and pork in black bean sauce. That pork in black bean sauce was nothing, but an eye wash. Small chunks of pork heavily supplemented with capsicum and onions. Also the sauce was so diluted such it was like water and being brown in color. The black bean sauce that I have seen from good quality Chinese restaurants in Sri Lanka and elsewhere is somewhat viscous and darker in color. They should rename this dish as “pork with capsicum and onion in black water sauce”.It is very sad that in Sri Lanka there are plenty of restaurants whose takeaways are somewhat expensive by Sri Lankan standard (many often with good names), but serve absolute rubbish thereby cheating the customer.","title":"Takeaways: Absolute Rubbish"},{"date":"2017-03-31T00:00:00.000Z","text":"Been here so many times... good chinese food at very reasonable prices. No wonder the place is always packed with diners. They have got the tormula right... They also deliver all over the area.","title":"Great value for money"},{"date":"2017-03-06T00:00:00.000Z","text":"We had visited this place from office for a lunch. There was lot of space to seat a crowd without running into others or overhearing other diners. Food was very good. All the preparations we ordered were good. good ambiance. Not highly priced. overall a very good experience. will visit more often with family.","title":"Good food"},{"date":"2017-02-06T00:00:00.000Z","text":"We wanted to enjoy some spicy Chinese food and dropped by to Steam Boat one evening. The place was little gloomy at first glance. later with more people coming in it got better. The food we asked, we told them to make it extra spicy. So it was up to our expectation. tho Dice chicken dish was really good, the Hot butter cuttle fish was really crispy. Service was not exceptional but alright. Can recommend however.","title":"Chinese food that is spicy"},{"date":"2016-10-22T00:00:00.000Z","text":"Good place for a meal . The boss is very polite . If you want fine a quiet place to enjoy your meal here is choice.","title":"Lunch here"},{"date":"2016-09-22T00:00:00.000Z","text":"Reliable chinese restaurant popular with locals. Tasty food in nice environment. Best I found around this area. Parking is difficult in most evenings.","title":"Nice Chinese restaurant"},{"date":"2016-09-16T00:00:00.000Z","text":"Their Nawala branch, once a favorite place for lunch and dinner was really popular for tasty foods and value for money. But unfortunately the quality of their foods are getting worse and service also not upto their reputed level.though the portions of food are large, the food is oily and their soups are not tasty at all.last time I tried their mixed grill which was a quite a large portion and had a good variety. their small rice portions can easily be shared by two.Waiters are friendly but not properly trained to give a proper service specially with providing necessary cutlery and things","title":"Average food and loosing its ambiance drastically"},{"date":"2016-07-13T00:00:00.000Z","text":"I normally visit to Nawala branch. Good place to be with family or with friends. If you are going for a drink the best place to be is at black out. You can have a peaceful drink and awesome foods. If you need to have a family dine in you can go to upstairs resturant where there is enough space and peace for a family dine in. Their food is delicious and the service is very good with friendly waiters. You can take away also. Price is also competitive all around I have pleasant experience every time I visit","title":"Nice place to drink and dine"},{"date":"2016-04-24T00:00:00.000Z","text":"I have been to this place with my girlfriend for a lunch. Rice dish was up to expectation but other dishes were below the expectation. More than anything plates were unclean and smelly. cutleries were not washed properly. I will not recommend this place.","title":"Not satisfied"},{"date":"2016-04-21T00:00:00.000Z","text":"I have eaten here several times. The food is quite decent. The drinks are NOT good (the juices etc). The service has also been been at an okay standard with more room to improve. Recently called to order a delivery and they said it will take 1 1\/2 hours to send someone over - which was quite annoying, but at least they were upfront about it.. So we ended up driving here and picking it up.","title":"Nothing exceptional. Decent food."},{"date":"2016-04-17T00:00:00.000Z","text":"Might be ideal if you looking for a budget food , but if you really a fan of food you will have lot of regrets , plus the service is terrible :(","title":"Too many regrets"},{"date":"2016-01-28T00:00:00.000Z","text":"It was good hotel in Sri lanka!!! I went for my office party. Good Experience with my friends and hotel environment was good.","title":"For Party !!!!"},{"date":"2016-01-13T00:00:00.000Z","text":"Ordered Thai green curry chicken and Thai red curry chicken for take away. However though the quantity is good it was definitely not up to their usual standard. The salad accompanying it was good. They obviously had stinted on the Kafir lime so there was very little flavour of that and it was too sweet.It was like they just added a little chillie to the green curry and called it Red currybuck upSteam Boat I have ordered many times from you so i know you have the ability to improve.","title":"ordered take away not up to their usual standard"},{"date":"2015-10-16T00:00:00.000Z","text":"If you need to have a chill out drink with a friend this is the best place. There is a bar in the down stairs called blackout which is an ideal place. Service is good and the food is also good prices are reasonable.If you need to have a family dinner a decent meal you ca go upstairs and have a calm and quite meal. Friendly staff and good service.","title":"Good place to chill out"},{"date":"2015-09-18T00:00:00.000Z","text":"Very popular place. Very average food. However not as good as before. Not suitable for tourists. Handy when you are local and need a quick meal.","title":"Average with a decent price"},{"date":"2015-06-30T00:00:00.000Z","text":"Parking mayhem is the problem. Food is good and decent place to enjoy with crowd. We went to order for outdoor event and checked on the food and it is tasty and good service was given.","title":"Steamboat testing out"}]