[{"date":"2018-05-28T00:00:00.000Z","text":"We visited thai boulavard with some friends. The service was excellent. The Manager of the restaurant made sure that we got the best service. We ordered the prawns in chilli paste, Hot buttrer cuttlefish, seafood fried rice, pork in chilli paste and prawn toast and spring rolls for starters. Everything was so nice and had great flavor","title":"The food was splendid"},{"date":"2018-05-25T00:00:00.000Z","text":"This is a restaurant that we return to time after time. The high quality of the cuisine never ceases to amaze us. The food is excellent ,the service superb and the overall ambiance is a pleasure. Definitely more pricey than the average place but you get what you pay for.","title":"Mouthwatering cuisine"},{"date":"2018-04-25T00:00:00.000Z","text":"Food was delicious and everything was served on plates. Service in this place was great! The atmosphere was relaxed. We got to meet the cook who was a lovely lady from Thailand. They also had vegetarian options on the menu.","title":"Very tasty thai food"},{"date":"2018-04-21T00:00:00.000Z","text":"Excellent place to taste Thai cusine, we had tom yum soup which was spicy and nice and afterwards chicken Satay and prawn toast as appetisers and for the mains we had baked sea bass, prawn green curry and black pepper prawn with steamed rice. The appetizers and mains were very flavorful. The serving staff were very helpful and selecting the dishes we want and ordering the correct portion sizes advising us not to buy more than what we require. All in all a great place to dine with great company !!","title":"A Tasteful Thai Experience !"},{"date":"2018-04-12T00:00:00.000Z","text":"Very good place for meals. Somewhat crowded mostly. Better make a table reservation. Excellent food & a Menu with a wide choice available. Parking may sometimes be difficult. Value for money.","title":"Excellent food"},{"date":"2018-03-19T00:00:00.000Z","text":"this is a fine dining restaurant with excellent thai food. quality is excellent too. prices bit on the expensive side.","title":"excellent thai food"},{"date":"2018-03-07T00:00:00.000Z","text":"My favorite restaurant for Thai food. The Tom Yam soup is super. Other items including the prawns ( Lemon grass and chillie past) , crispy pork , green Papaya salad etc are all great. Always end with Sticky rice and Mango for dessert.","title":"Favorite Thai food restaurant"},{"date":"2018-02-18T00:00:00.000Z","text":"Lovely restaurant for mid-range authentic Thai food. You need to make a reservation as the place does get quite crowded but if you are happy to wait for a while which is what we did, you will not be disappointed. The quality of food was excellent and the potion size really good.Prawn papaya salad, pork satays and pineapple rice were definitely hits with our group!","title":"Good mid-priced Thai food!"},{"date":"2018-02-09T00:00:00.000Z","text":"Thai Boulevard (which I believe it is now called) has delivered each time. They did not disappoint this time either.Started with the prawn toast. Good. On mains, the crispy pork with hot basil leaves was a hit, and the chicken massaman curry was very nice. But my pick was undoubtedly the grilled sea bass with lemon chilli sauce. Had this before and it’s been great every time!They don’t have a liquor licence, so means you can BYO. No corkage.Recommended go-to for Thai food in Colombo","title":"Recommended for Thai Food in Colombo"},{"date":"2018-01-19T00:00:00.000Z","text":"We stumbled upon this restaurant and were absolutley delighted to have done so. We had no reservation on a busy Friday night, but they accommodated us anyways. The food is authentic and delicious; the service is wonderful; and we felt so welcomed! Highly recommended for Thai food - definitely have the green mango salad, the crispy pork, and the fabulous crispy chicken salad. WONDERFUL!","title":"Loved it so much we went twice over the course of a week!"},{"date":"2018-01-19T00:00:00.000Z","text":"I wanted to taste genuine Thai food while in Colombo and went with friends on a recommendation. I was not disappointed. The service was excellent and the food was superb. If you have not tasted Tamarindn Juice drink, have a go, it is delicious The menu range is good and by International standards, the price is not high. The interior is a bit bland but spacious and tidy.","title":"Delicious authentic Thai food in Colombo"},{"date":"2018-01-14T00:00:00.000Z","text":"Top Notch Thai Food, with superior service. Prices are on the higher side normal dish around LKR 1,000 to 1,5000 but unlike other high end restaurants, VAT is included in the price and only 10% service charge will be added to the final bill. Portions are quite huge. If you are a normal eater and not looking for so many dishes to try , one main dish and another dish would filling for two. They have selection of wine and beer but expensive. But good thing is you can BYOB no problem.","title":"Top Notch Thai Food, with superior service"},{"date":"2018-01-03T00:00:00.000Z","text":"This was recommended to us by my sister in law. It did not disappoint! The food was great! Definitely a joy for the taste buds, and the portions were pretty big, but we were glad to take the rest back our apartment for later.","title":"Very Delicious Food"},{"date":"2017-12-23T00:00:00.000Z","text":"This restaurant came highly recommended so I entertained 8 people for dinner. While the service staff were pleasant and accommodating - they very kindly acceded to my request to be seated outside, the service was painfully slow, and detached. We waited a very long time for our drinks and they came in stages...first two, then another two...it was quite annoying.We had almost a one hour wait for our food. The quantities the waiter suggested were far in excess and again, the salad arrived long after the hot food. The hot food too came in stages - two portions first, then another portion. This made for quite an unpleasant and interrupted dining experience.The food was more Sri Lankan than Thai. We missed the Thai flavours and the dishes were full of condiments - large slivers of kaffir lime leaves and lemon grass. It was also quite pricey. The sea bass and coconut soup was highly salted although it was full of succulent seafood and mushrooms.The service staff were very good but they were grossly understaffed for a busy Friday night.","title":"Disappointing and unremarkable"},{"date":"2017-12-18T00:00:00.000Z","text":"The food was very tasty, and the service quick. The portions are pretty large and too much if shared by only 2 persons. Strongly recommend the Prawns Crispy Garlic with steamed rice. They have a signature drink - Passion Paradise - rather exotic,little on the sour side.","title":"Great Thai Food"},{"date":"2017-11-15T00:00:00.000Z","text":"The food is tasty.The service very good.The prices similar to other restaurants.The ambience is very good.","title":"Good"},{"date":"2017-11-08T00:00:00.000Z","text":"This place is great for Thai food and fine dine experience. There portions are large. The stir fried cuttle fish with Ginger and Garlic was Yum. The seafood noodles is enough for at least 3 people and can have it on its own. Friendly staff. great location.","title":"Thai Fine Dinning in Colombo"},{"date":"2017-10-10T00:00:00.000Z","text":"The Boulevard was booked in advance for a dinner given by me and the chef was extremely helpful in his suggestions in the way of how many portions to order and what goes well with what etc. The dinner was a super success mostly due to the very good food that was served and the helpful and cheery attitude of the waiters who were just a hearing distance away to our needs but never invasive. At the end of the dinner they created the right atmosphere for the birthday candles to be lit and was once again helpful in serving the cake and drinks. Altogether a very pleasant experience and one that we will surely repeat in future. Did I mention the yummy food?","title":"Perfect Place for a family Birthday Dinner"},{"date":"2017-10-06T00:00:00.000Z","text":"Caught up with a few friends for lunch. Thanks to mama, food is delicious, well presented, portions reasonably sized, courteous and good service though a bit pricey in comparison to five star hotel restaurants in Colombo. A bit different to Thai food in Western countries (much tastier). Parking can be an issue.","title":"Lunch at Thai Cuisine Boulevard"},{"date":"2017-09-06T00:00:00.000Z","text":"in town! Really authentic food, spicy but still managable, there ist chilli on the side. Competent personell.","title":"Best thai"}]