[{"date":"2018-07-18T00:00:00.000Z","text":"If it’s a self service coffee place how can all the tables be reserved? If you are going to have reservations you should have a waiting list for people not to order and wait till a table is free.Let’s start with customer service. One of the waiters, literally, kick me out of one table, he didn’t ask me to, he told me to move and find another table in the worst manners ever. You should give them a proper training because I think rudeness should be the way of approaching to customers.I went to the second floor to find my table and all the tables were dirty, full of flies and mosquitos. I asked them to clean one for me to be able to wait 35 minutes for 2 slices of cake, one milkshake and one tea.Food: it has tooooons of sugar added. I know it’s a slice of cake but there’s a limit in the sugar amount. Chocolate cheese cake base was made with a lot of sugar, you can feel it in every bite. Tres leches cake was made with coconut milk, that’s not the way it should be and it was thick and dry in the middle. And my chai tea... omg! How can someone make a chai tea with condensed milk!!! It was extremely sweet. Chai tea should not have milk unless it’s a chai latte and it should definitely not have sugar added unless the customer asks for it.I call the waiter to come for me to ask him somethings and he told me “what do you want” and not even got close to the table. He was just standing at the stairs waiting for me to talk. (Same guy that kick my from the table).The place is really nice and has a lot of potential but the service and the food need to improve, specially customer services, I can handle the sugar but rudeness never.","title":"Worst Customer Service"},{"date":"2018-07-11T00:00:00.000Z","text":"Super location. Beautiful and cozy ground floor. There is gaming upstairs.Its basically a place for kids. There is no alcohol and you aren't allowed to bring your own and there is no Pork either. You have to queue up at the cashier and order your food. That's OK for kids but it's just not acceptable if you take guests there.They have some interesting smoothies and fruit drinks around 500\/- each. Food such as burgers, fish and chips, Nasi Goreng etc priced around 1,000\/- upwards. Coffee is around 400\/- a cup. The food is served hot and is generally palatable but there is nothing memorable enough to return for a second visit.The prices on the menu are absolutely honest. What you pay is what you read there. No additions of taxes or charges for service.","title":"A place for kids"},{"date":"2018-07-06T00:00:00.000Z","text":"I love everything about this place. From food to ambience. AMAZING!having two game stations has got to be their advantage over the other cafes in CMB. BUT, BUT, this is more than a Cafe!!!!Cute, Elegant and a beautiful place with DELICIOUUUUUSSSS FOOOOOD and DRINKSSS that suits the price ! :)","title":"LOVE LOVE LOVE!"},{"date":"2018-07-01T00:00:00.000Z","text":"The Embazzy has a space for a small party upstairs, in addition to the coffee shop down stairs. It's a good private facility for a crowd of about 50-70 people. The service is good and the bites served for drinks is also tasty and spicy. The general food for dinner is average.","title":"Party at the Coffee shop"},{"date":"2018-07-01T00:00:00.000Z","text":"Well to begin with , I came for my birthday dinner here and if I'd sum up my dining experience , it can be simply said as classy and very fine. The food was unbelievably yummy and the ambiance was great . The overall look of the building on the inside as well as the outside is very smart , creative and attractive . With the positives , there follow a couple of suggestions or rather improvements . The dish I ordered which was Peri Peri chicken was good although I didn't get the standard Peri peri sauce which was quite surprising . The drinks that have lime included should be less sour as when I had my drink , it was very sour and had a bitter kick.The service could be slightly faster and the waiters should be more alert . In all I would definitely recommend this place and hopefully these observations are taken into consideration.","title":"A little of everything"},{"date":"2018-07-01T00:00:00.000Z","text":"What a fabulous building !!! This is located in a prestigious area of Colombo and is an old Colonial building modified into a restaurant. The timber work was beautiful and looked like old polished Teak wood. The decor was very much the old Colonial style with Antique furniture and deep leather couches. A fabulous staircase (timber ) lead up to a gaming and recreation area.I did, however, think the ambience would improve with softer lighting, but since its a \"Cafe\" style place bright lights were acceptable. The area at the front for drinks and chat was very comfortable, and it was also possible to sit here to wait for a table if one hadn't been booked.It was difficult to attract a waiter, and one had to go to the counter physically to order and get served.This was surprising since we were dining at 9.30 pm, and there was no rush at all.Our Virgin Mojito's were excessively sweet!!! and apparently had added sugar syrup, which we suggest should be optional and be served in a separate container. We abandoned these and ordered plain Fresh Lime instead which came with sugar syrup served separately. !!!! Much betterWe were somewhat disappointed with some of the food we had although the Fish and Chips was excellent. I had the Seafood Risotto which was gluey and over cooked. My friend had the Salmon which was slightly overcooked and dry. My husband had the Fish and chips (excellent). Presentation of the food was excellent.The Meringue for the Pavlova was rock hard but the Berry sauce and presentation were super.Coffee was the best part of the evening . Great flavor.Will probably return, but perhaps not order a main course, just a snack and coffee.","title":"Late night food at the Embazzy"},{"date":"2018-06-24T00:00:00.000Z","text":"First of all the place is huge with plenty of space for groups, individuals etc. Food looks great and tastes even better.","title":"Great place to hang out"},{"date":"2018-06-21T00:00:00.000Z","text":"The atmosphere is great and in the vibe is of a chic cafe. We loved the decor and the ambiance. Menu was good and there was a respectable choice of items. The mains were meh, and we felt they did not try hard enough. Both my burger patties were burned in the middle and the other mains did not wow us either. Desserts were another story. We loved the brownies, cakes, churros and cookies we ordered.Services had its ups and downs as well. The staff were friendly and accommodating. But some of the wait staff were not attentive enough. We had to remind them several times on certain requests. They seemed overwhelmed with the full house and not trained enough.Overall we were not wowed, but cannot complain as well. Embazzy has the potential to be a great spot and if they pull up their socks I would say that this would be a good place to visit.","title":"Room for improvement"},{"date":"2018-06-18T00:00:00.000Z","text":"This restaurant become our favourite place for lunch, love the food here and all staffs always very friendly and helpful. The Thai green chicken curry, fish 'n chips and smoked salmon pasta were my favourite. The coffee and cakes were always very nice too. The most important thing is that the price were reasonable. Highly recommended for both lunch and dinner.","title":"Tasty food, Good Service and Excellent atmosphere!"},{"date":"2018-06-12T00:00:00.000Z","text":"They have a range of dishes from various parts of the world and everything I have tried so far taste really good. (Prices are reasonable too) It's a good hangout place for a bunch of friends but they also have corners where you can open you laptop and work. Friendly staff, good service.!","title":"Good Food, Good Ambience"},{"date":"2018-06-11T00:00:00.000Z","text":"This is one of the best places to hang out with family and friends. The food is absolutely heavenly! Staff is friendly and helpful too. A good time is guaranteed!","title":"Amazing food"},{"date":"2018-06-10T00:00:00.000Z","text":"If at all a review must be written, it should be done in as little words as possible. I wouldn’t want to be the spoiler to your dining experience, so I’ll just say it in as few words as possible and let you experience the rest.Arrive and witness - a truly aspiring outlet - of food and service that is as genuine as it is humble.I keep coming back. I’ll keep coming back.","title":"It’s a people pleaser"},{"date":"2018-06-05T00:00:00.000Z","text":"One of the best places in Colombo to go hang with your friends! I love the food at The Embazzy and the staff is really friendly and helpful. You won't be disappointed, your stomach will be pleased and your wallet won't be completely empty...","title":"Great place"},{"date":"2018-06-04T00:00:00.000Z","text":"You visit it once and you want to go back all the time, a place to relax with family and friends, a variety of deliciously prepared food, courteous service, no hesitation it's one of the best restaurants in Colombo.","title":"Good food excellent service"},{"date":"2018-06-02T00:00:00.000Z","text":"The food was absolutely wonderful, from preparation to presentation, very pleasing. We especially enjoyed our time at The Embazzy. The place is really nice and comfy. Must try!","title":"Best place to hangout with friends"},{"date":"2018-05-30T00:00:00.000Z","text":"Cozy and spacious atmosphere. Staff is friendly, helpful and displays a high level of professionalism in terms of their service. They have a wide range of delicacies spread across their menu, all with great portion sizes. Prices seems a bit high but considering all aspects, I would say its worth the spend.","title":"Great ambiance, excellent service!"},{"date":"2018-05-30T00:00:00.000Z","text":"Lovely place, interesting decor, good food, healthy juices and most of all excellent service ! Will def come back to chk out the rest of the menu","title":"Excellent service !"},{"date":"2018-05-23T00:00:00.000Z","text":"A good selection of food, something for everyone. Staff courteous and friendly from a distance. Prices reasonable. Will return for something more....","title":"Dinner"},{"date":"2018-05-21T00:00:00.000Z","text":"We just loved the Ambiance at Embazzy. Its very homely and plush. The Milo Dinasaur was heavenly and the best that I have tried. The fish n chips were also good. However the Aussie pharma is a highly recommended dish, yet we did not like it much. But its a great place to relax and unwind and the service is great. Kids also had fun as they got many kids games upstairs","title":"Great Ambiance"}]