[{"date":"2018-11-12T00:00:00.000Z","text":"Spent an amazing week at the RC last month. Our first time in Singapore and we couldn't have stayed anywhere better. Fabulous hotel as one would expect from RCH. We had a Marina view room with sensational views of this beautiful city. Great central location. First class service from every single member of staff we met. Outstanding service from Sandrine Qu and her team, truly exemplary. They looked after us and treated us sooo very well making this a truly memorable holiday. Wonderful little touches left in our room which were very much appreciated. Sandrine is an absolute asset to the RCH brand, her expertise, professionalism and warmth of character are a credit to the hotel. Another stand out was Head Bartender Martin... what a fantastic world class bar tender! Fantastically skilled, wonderfully knowledgable and such a great guy to chat to, my husband and I enjoyed our time with him... he even named a newly devised cocktail after me... Marina! Superb restaurants catering to your every desire, first class service, exemplary concierge service especially young intern Daryl Seah who clearly has a great career ahead of him. Sincere thanks to Sandrine, Martin and their teams who made our stay absolutely perfect! Couldn't recommend the Ritz Carlton Millenia highly enough! K & M.","title":"Absolutely Amazing stay at the Ritz Carlton Milenia Singapore!"},{"date":"2018-11-11T00:00:00.000Z","text":"I've just returned from a short business trip to Singapore where I stayed, as usual, at the wonderful Ritz Carlton. My trip was really enhanced by spending a couple of hours at the Chihuly Lounge, where I received the very highest standard of service by Sandrine, and got to enjoy a great music set by Daniel Park - a really great evening.","title":"Great evening in the Chihuly Lounge"},{"date":"2018-11-11T00:00:00.000Z","text":"We checked into Ritz Singapore as just another Ritz. But Daniel Park's live music at the bar made a difference. One of the best music performance and voice we've heard for years and full of emotions too.Also don't forget to look for Sandrine, manager at the bar, she WILL take care of you as a family, as a great friend.Sandrine and Daniel made the overall experience an unforgettable one.","title":"Great music and great experience"},{"date":"2018-11-11T00:00:00.000Z","text":"So i went colony for buffet last week with my family, and its my second time coming over. I must say im still very impressed with the servers’ and chefs’ attitude and the way they assisted us. And when i was at the ice cream starion, i met Chef Eugenia again, and apparently she remembered me and most importantly is that she remembered what are the flavours that i like for the ice cream. And to my surprise, she actually bring the icecream over to our table. I must say that she is a really nice and polite person. And for the names that was written on the sliding glass for the icecream, im glad that she actually wrote it in chinese too. And when i asked her why, she say its easier for people who doesnt know english well to know what flavours are there, and im impressed.","title":"Colony"},{"date":"2018-11-09T00:00:00.000Z","text":"Great location. Make sure you ask a room with a view on Marina Bay, for the view, in particular at night. Service is impeccable, everything is super clean and the food is good and a bit expensive. Breakfasts are very elaborate and can be a culinary experience by themselves.","title":"Spectacular in all aspects!"},{"date":"2018-11-09T00:00:00.000Z","text":"On the final night of a five night stay at the magnificent Ritz-Carlton Singapore. We stayed in a Club Suite and had the use of the Club Lounge throughout. The service was absolutely superb especially from Dorene and Darryl in the Club Lounge, nothing was too much trouble.We can’t recommend this hotel and the above mentioned staff highly enough!Would definitely return!!","title":"Superb"},{"date":"2018-11-06T00:00:00.000Z","text":"We travelled to Singapore in September and stayed at the Ritz-Carlton for 5 nights. The hotel is beautiful and our room was breathtaking, we woke up every morning with a massive view of Singapore.The staff were very friendly at the hotel, especially Ridhi who helped us from the first day we arrived. She made the stay very special, we would like to thank her for her hospitality and for the all the extra effort she went through for us.As we were staying for our honeymoon, the hotel gifted us with special treats every night, which was a really lovely thought.We thoroughly enjoyed our stay, the concierge were helpful in making arrangements and giving us ideas on what activities to take place in. We definitely recommend the Ritz-Carlton, as it will be a memorable stay.","title":"Really enjoyable stay at the Ritz-Carlton"},{"date":"2018-11-06T00:00:00.000Z","text":"When I checked in late at night rubbing my sore back from the long distance flight, the receptionist asked the housekeepers to send a bottle of red-flower oil (Chinese medicine for muscle cramp) to my room. When I had a trip to the buffet breakfast station but forgot to take a pair of chopsticks, the server added a pair on my table without me asking. This is what personal service is about. There are many five-star hotels in the marina bay, Mandarin Oriental, Marina Sands, just to name a few. I stayed in most of them. What set Ritz apart from the rest is its personal service.","title":"Personalized Service Set Ritz-Carlton Apart from Peer"},{"date":"2018-11-06T00:00:00.000Z","text":"We went for our family trip to Singapore and stayed at the Deluxe Kallang Room. Amazing view of the entire city. We were 3 people and requested a rollaway bed. The staff was very friendly and did everything to help us stay comfortable.The Breakfast Buffet at the Colony restaurant was the highlight of our day :) Soo many varieties to start your day with , food quality was outstanding. Their gym and swimming pool was also very well equipped.My father was not able to walk long distances so the hotel let us keep the wheelchair throughout our stay. Was extremely helpful. We took the hotel car while going out few times, there are also alot of taxi's available right outside.Alot of great resturants and malls are walking distance of the hotel.Hotel is definitely on the pricey side but completely worth it ! Will return to this hotel when ever i come back to Singapore.","title":"Simply Exquisite"},{"date":"2018-11-03T00:00:00.000Z","text":"After a terrible experience at the front desk check in (very rude!!!) things improved tenfold after we met Sandrine Qu in the Chihuly Lounge.We arrived at 6am and were informed at check in that our room would not be available until 2pm. We were allowed a shower in the spa to freshen up and then had breakfast in the dinning area. Both of us were extremely tired after the overnight flight and decided to request for our room again. This time I was told it would not be ready before 3pm!!! So we asked where we could rest (\"just take a seat on the lounges\"). We sat there (both falling asleep) for about an hour.While resting we overheard another guest being offered a room as soon as soon he arrived, my wife decided to approach the front desk again. She was informed that they would look for room (this is large hotel and there was NOT A SINGLE person checking out early!!!!!! unbelievable.) We did finally get our room at 11am. We rested in the room and then came down to the Chihuly Lounge where we met Sandrine (a cheerful lady who goes the extra mile in ensuring all guests are looked after). Sandrine and her team \"MADE\" our stay at the Ritz and we cannot thank her enough.","title":"One of the best - thank you Sandrine QU"},{"date":"2018-11-03T00:00:00.000Z","text":"I took my sister to The Colony buffet for her birthday dinner.I’ve been to many a five star hotel in Australia for a buffet dinner - this is up there as the best!!1. Loads of choice. It seemed that most countries style of food was represented. The staff are a hive of activity making sure that all the options are available and fresh - it is hard to move onto the next course, you want to have more of what you’ve just had!!2. The seafood is amazing- and trust me as Australia’s seafood is awesome I’ve had some of the best. There are oysters from New Zealand and France, crab and lobster - and prawns- no work required on the consumers part!! Just eat and enjoy3. The cheese was the best I’ve had.It all exceeded expectations- needless to say my sister was stoked - but on top of this 5 of the wait team came and sang happy birthday- providing a cake I’d not organised and a card with messages from each them.The team bent over backwards to ensure we had all we needed and had a great night.A special mention to Mohamed Shah - the Banquet Operations Manager - who took time to chat with us and ensured everything was perfect. A very helpful and friendly man whose team are a credit to the Ritz Carlton. I can’t wait to return in the future so my husband can have this fantastic experience with me.","title":"Outstanding buffet"},{"date":"2018-10-30T00:00:00.000Z","text":"Undoubtedly one of the best hotel to stay. Been here twice for Business Visits. Their customer service is superb ..or you can say Best Of Best. Wide variety of Food and what a room to stay in. View from hotel is just amazing.I vouch for my words...Go and book without any second thoughts.","title":"Best Hotel in Singapore"},{"date":"2018-10-28T00:00:00.000Z","text":"The Ritz Carlton is Perfection Personified in the true sense! From the moment you step you step inside the lobby, the skylight and freshness lights you up. Everything there on just keeps topping the last. The staff is not only friendly but also are a part of the most efficient team I’ve seen. The hygiene levels - are a benchmark that other properties should live up to. The food and especially the buffet at the Colony Restaurant - is a huge scrumptious spread! The only problem is that there’s so much variety that you don’t know whether you want to have a double helping of your favorites or try a whole new delight!A huge round of applause to everyone who makes the Ritz a heavenly stay! Special mention to LiLing, Ken & Kent - thank you for your help and assuring we had a super Business Meet!","title":"Stay At Ritz Carlton"},{"date":"2018-10-26T00:00:00.000Z","text":"Its my first time to stay in Ritz Carlton Singapore. The place is nice and really one the best hotels. Unfortunately it will be the last also as the front desk staff was quite rude and not accomodating. Very frustating.","title":"Unfriendly Front desk staff"},{"date":"2018-10-26T00:00:00.000Z","text":"Everything about this hotel screams five stars from the rooms to the staff and the locations. However, Fatyn really made our stay here unforgettable with her professionalism and outstanding service. We mentioned that we were staying here as part of our honeymoon and Fatyn was able to get us a room near the top, which was much appreciated. She wanted to find us a marina view room but they were fully booked and we were already grateful as we didn't expect any levels of upgrade. She also sent us a plate of desserts and chocolates along with a hand written card which really brought our experience over the top. I would highly recommend this hotel to anyone staying in Singapore and I hope they are fortunate enough to meet Fatyn","title":"World class view with servie to match!"},{"date":"2018-10-23T00:00:00.000Z","text":"Ritz Carlton is the place with Ma 1st preference olways m olways impressed by how fantastic the hotel is and its renowned customer service. I came back this time for dinner yesterday (22\/10\/18) with Ma frnz Once again.. I must say the service nd attention given by Mr. Ritesh Rajan, the Station holder Ms. Elsa nd Chef Chua blew us away! Some more they gave a small surprise as dey came with a small lovely cake in group leading Mr. Ritesh Rajan nd sudden started singing Ma b’thday song I was more Happy nd filled wid proud cuz I was the 1 who took Ma frnz to Ritz nd I have olways been sharing Ma good experience about Ritz Carlton visits wid dem, but dis tym I was quite cuz they were feeling everythn wat I was feeling .. cannot think of a better place to pamper ourselves than being at ‘Ritz Carlton Colony Restaurant’.... Soon i’ll b dere again with Ma frnz ..","title":"‘ Ritz Carton Millenia’.. Probably the best Hotel & service the 1can ever ‘pamper’ themselves with..Fantastic !!"},{"date":"2018-10-22T00:00:00.000Z","text":"At the end of a great trip to Japan, we stayed for one night in Singapore on the way home . We decided to book the Ritz Carlton because of the good TA reviews.We were so glad we did. From the moment you arrive to the time you check out, you feel very much the valued guest.We arrived early for check in having flown from Osaka overnight. Although check in is at 15:00 they had us in our room at 11:30 which was a great relief. Our room on the 7th floor overlooked the Marina and was large and very well equipped, with a king size bed and huge bathroom with shower and bath looking out over the Marina and beyond.In the afternoon we received a box containing strawberries with a chocolate sauce plus a handwritten note from the lady who checked us in - nice touch and something that was repeated after we checked out. The woman who handled our check out was Japanese and when we told her how much we had enjoyed our visit to Japan, she sent us a handwritten note plus a piece of Origami thanking us for staying at the Ritz Carlton.We were too tired in the evening to go out so had dinner in The Colony Restaurant. The Buffet looked amazing and was very reasonably priced but too much for us although it seemed that everyone in the packed restaurant had chosen this option.We did have the Buffet breakfast next morning and it was indeed impressive. Throughout our short stay we were treated with smiles and courtesy by every member of the staff we came into contact with and I think that the management have done a great job in making this a perfect place to stay in Singapore.If you can, book a room with a Marina view. It is certainly worth it especially when it gets dark as the lights on the water and the high rise buildings are great to look at.Thanks to you all","title":"Wonderful"},{"date":"2018-10-22T00:00:00.000Z","text":"Fantastic stay for one night with the whole family. Super nice room with a view (Marina Bay), delicious breakfast and the children loved sleeping in the safari tent that was put up in our room. Very friendly and helpful concierge!","title":"Fantastic stay!"},{"date":"2018-10-19T00:00:00.000Z","text":"excellence service for this brand, i love the superb service. kind friendly and helpfull staff, reception will help you for sure and accomodate as your request accordingly and I stay in Marina view that was awesome and alsobreakfast was perfect, i love all of the choice of breakfast","title":"Good price with great service"},{"date":"2018-10-19T00:00:00.000Z","text":"Everything is beyond words! From the exceptional service to the beautiful and comfortable room. Everything was almost perfect! I was supposed to stay in a different hotel but my friend convinced me to try Ritz Carlton. And i never had any regrets that I did.Upon arriving the luxurious hotel. You’ll be welcomed by the grand lobby and friendly staff who will then escort you to the check in counter. Check in was smooth and fast. We arrived a little early so our room was not yet ready. We left our bags and started exploring singapore. Went back to the hotel around 5pm and our bags are already in our room.The room was huge and the bed was very comfortable. But I think the showstopper is the bathtub in the bathroom with an amazing view.Location is okay. A few minute walk to the nearest mrt stations.I was also able to try out the pool at night and had the entire pool all to myself. It was superb! This hotel might be a little pricey but you get what you pay for. Can’t wait to bring my family and friends to another Lion City shopping. Will definitely stay here again. Very much recommended.","title":"Late Birthday Vacation"}]